202001161251243550PG-Ordinance Final_Revised.pdf|0|ORDINANCES GOVERNING POSTGRADUATE PROGRAMMES Passed in the 9th Senate Meeting held on Friday, September 13, 2019 RAJIV GANDHI INSTITUTE OF PETROLEUM TECHNOLOGY JAIS, AMETHI Acknowledgement The Ordinan
202001161251243550PG-Ordinance Final_Revised.pdf|1|2.1.A.1. M.Sc. 3 2.4.A.2. M. Tech. 3 2.4.A.2.1 Full Time Regular Registration Category 4 2.4.A.2.2 Financial Assistance 4 2.4.A.2.3 Full Time External Registration Category 4 2.4.A.2.4 Full Time Spons
202001161251243550PG-Ordinance Final_Revised.pdf|2|2.4.B.1.7 Part-time Registration Category 9 2.5. Selection Process 10-12 2.5.1 M. Tech. Programme 10 2.5.2 Ph.D. Programme 11 2.6 Admission of Foreign Nationals 12 2.7 Admission of Non-Degree Students
202001161251243550PG-Ordinance Final_Revised.pdf|3|4.2.1. Vacation and Casual Leave 18 4.2.2. Medical Leave 18 4.2.3. Maternity Leave 18 4.2.4. Semester Leave 18 4.2.5. Leave for Professional Employment 19 4.2.6. Medical Certificate 19 4.2.7. Absence 
202001161251243550PG-Ordinance Final_Revised.pdf|4|6.5. Computation of Semester Performance Index (SPI) and Cumulative 25 Performance Index (CPI) 6.6. Make-up Examination 26 6.7. Academic Performance Requirements 26 3 | P a ge 6.8. Exit from Ph.D. in 
202001161251243550PG-Ordinance Final_Revised.pdf|5|10.2.4. Ph.D. Oral Board 33 10.3. Submission of Thesis 33 10.3.1. M. Tech./M.Sc. Thesis 33 10.3.2. Ph.D. Thesis 33 10.4. Processing of the Thesis 33 10.4.1. M. Tech./M.Sc. Oral Examination 33 10.4.2. 
202001161251243550PG-Ordinance Final_Revised.pdf|6|42-44 for Ph.D. Programmes Table 4 : Disciplines-wise Research Areas for Ph.D. 45-47 Programmes Annexure – III : Reservation of Seats 48-54 III.1 : Form of the Certificate to be Produced by Scheduled 
202001161251243550PG-Ordinance Final_Revised.pdf|7|India Annexure – IV : List of External R&D Organizations Recognized by the Institute 55 Annexure – V : Examples for Credit Calculation 56 Annexure – VI : Specification and Information regarding the Pr
202001161251243550PG-Ordinance Final_Revised.pdf|8|a domain specific Institute and the prime objective of the Institute is to provide world class education, training, and research to roll out efficient human resources to meet the growing requirements 
202001161251243550PG-Ordinance Final_Revised.pdf|9|RGIPT is co-promoted as an energy domain specific institute by six leading Oil Public Sector Units (ONGC, IOCL, OIL, GAIL, BPCL and HPCL) in association with the Oil Industry Development Board (OIDB).
202001161251243550PG-Ordinance Final_Revised.pdf|10|social sciences areas including English, Sociology etc. The institute has a department of Management studies consisting faculty members from diverse areas ranging from Accounting, Economics, Finance, 
202001161251243550PG-Ordinance Final_Revised.pdf|11|impart education with sound theoretical and experimental background in frontier areas of research in engineering, sciences and interdisciplinary subjects. The emphasis of P.G. programme is on understa
202001161251243550PG-Ordinance Final_Revised.pdf|12|students for societal, industrial and national service. With these goals in view, the postgraduate programmes include courses, seminars and project/thesis through which a student may develop rational 
202001161251243550PG-Ordinance Final_Revised.pdf|13|6 | P a ge The SPGC, established according to the by-laws of the Senate, operates through the Department Postgraduate Committees (DPGCs) to administer all aspects of the PG programmes. The constitutio
202001161251243550PG-Ordinance Final_Revised.pdf|14|Mechanical Engineering, Chemistry, Mathematical Sciences, Physics and Humanistic Studies including English. 3. Special programmes to cater the specific needs of any major sector such as Petroleum, Def
202001161251243550PG-Ordinance Final_Revised.pdf|15|reasons on the recommendation of the DPGC and the Dean (Academic Affairs). All such exceptions shall be reported to the Senate in its next meeting. 2. ADMISSION 2.1. Academic Session The academic sess
202001161251243550PG-Ordinance Final_Revised.pdf|16|The last two weeks of each semester are utilized for end semester examinations and one week period during the semester is utilized for the Mid Term examinations. Thus, there are about 13-14 working we
202001161251243550PG-Ordinance Final_Revised.pdf|17|3. The Indian Nationals Residing Abroad (INRA)/from external in PMRF may be admitted to Ph.D. programmes during the course of a semester as per the provisions of Section 2.4.B. 2.3. Reservation of Sea
202001161251243550PG-Ordinance Final_Revised.pdf|18|M. Tech. Programmes Full Time Registration Part Time Registration (for Project Staff/Permanent Employee/ Professionally Regular External Sponsored Employed within 50 Km) 2.4.A.1.1 Full Time Regular Re
202001161251243550PG-Ordinance Final_Revised.pdf|19|Aptitude Test in Engineering (GATE) for M. Tech. Programmes with validity not expired. 2.4.A.1.2 Financial Assistance Financial assistance in the form of Institute Aassistantships is available to the 
202001161251243550PG-Ordinance Final_Revised.pdf|20|No student shall be admitted to Full time Regular Registration Category without Institute Assistantship. No student can get financial assistance from more than one source at a time. 2.4.A.1.3 Full Tim
202001161251243550PG-Ordinance Final_Revised.pdf|21|concerned (see Sec. A.2.1 and Table 2 Annexure-II). Such a candidate must show satisfactory performance in the interview, must be sponsored by his/her employer and must have been in employment with th
202001161251243550PG-Ordinance Final_Revised.pdf|22|facilities of his/her organization would be made available to him/her for carrying out research. 8 | P a ge He/she should also provide the bio-data of the prospective supervisor along with his/her con
202001161251243550PG-Ordinance Final_Revised.pdf|23|admission of sponsored candidates to M. Tech. programmes. The committee may, upon inspection, also approve all the areas in which R & D activities are going on in that organization. 2.4.A.1.4 Full Tim
202001161251243550PG-Ordinance Final_Revised.pdf|24|admission. The sponsoring organization must specifically undertake to provide full salary to the candidate and to relieve him/her to pursue the programme for its full duration. Such candidates have to
202001161251243550PG-Ordinance Final_Revised.pdf|25|2.4.A.1.5 Part-time Registration Category The Institute offers part-time M. Tech. programmes for permanent staff and faculty members of the Institute as well as research assistants working in an exter
202001161251243550PG-Ordinance Final_Revised.pdf|26|The Institute offers part time M. Tech. Programme also to a professionally employed person, who pursues the programme while continuing the duties of his/her service provided the sponsoring institution
202001161251243550PG-Ordinance Final_Revised.pdf|27|[N.B.: Letter of appointment and Form 16 issued by the employer for two years of service is required at the time of written test/interview. In addition, the must submit an undertaking that he/she shal
202001161251243550PG-Ordinance Final_Revised.pdf|28|Regular External Sponsored Employed within 50 Km) 2.4.B.1 Full Time Regular Registration Category Applicants must have the requisite qualification with minimum marks/CPI as mentioned below in the disc
202001161251243550PG-Ordinance Final_Revised.pdf|29|master’s degree level. b) Applicants with bachelor’s degree in engineering in the discipline concerned or in an allied discipline/area must have a minimum of 75% marks or 7.5 CPI (on a 10.0 point scal
202001161251243550PG-Ordinance Final_Revised.pdf|30|(i) A minimum of 65% marks or 6.5 CPI (on a 10.0 point scale) at the master’s degree level, (ii) A minimum of 60% marks or 6.0 CPI (on a 10.0 point scale) at the bachelor’s degree level. Ph.D. in Scie
202001161251243550PG-Ordinance Final_Revised.pdf|31|minimum requirement shall be 70% marks or 7.0 CPI (on 10 point scale) at bachelor degree provided the degree is from an Institution funded by the Central Government. Ph.D. in Humanistic Studies a) App
202001161251243550PG-Ordinance Final_Revised.pdf|32|with more than two years of professional experience, the minimum requirement shall be 70% marks or 7.0 CPI (on 10 point scale) at bachelor degree provide the degree is from an Institution funded by th
202001161251243550PG-Ordinance Final_Revised.pdf|33|Candidates who fulfil the above mentioned eligibility criteria and have a qualified score of any of these examinations: CAT/GRE/GMAT/NET (UGC/CSIR) are eligible to apply. Important: The candidates mus
202001161251243550PG-Ordinance Final_Revised.pdf|34|Candidates appearing for their final year examination in the current academic year may also apply, however, their admission to the program will be provisional subject to their successful completion of
202001161251243550PG-Ordinance Final_Revised.pdf|35|3. First class or 60% marks (55% marks for SC/ST/PH)/CGPA or CPI of 6.0 in Master’s degree in relevant discipline and qualified score of GATE/ CSIR/ UGC/ NBHM/ DBT/ GPAT/ Rajiv Gandhi National Fellows
202001161251243550PG-Ordinance Final_Revised.pdf|36|The NET-LS qualified students may also be eligible for Institute Assistantship in Humanistic Studies Department provided they have CPI 7.0 (on a 10 point scale) or 70% marks in the qualifying examinat
202001161251243550PG-Ordinance Final_Revised.pdf|37|Applicants who are either of sponsored registration category or who are already awarded fellowship by external agencies or Part time registration category or external registration category can submit 
202001161251243550PG-Ordinance Final_Revised.pdf|38|b) Other Ph.D. Students working in various projects be given half of the Institute Assistantship upon completion and closure of their Project Fellowship. However, such Ph.D. students may join projects
202001161251243550PG-Ordinance Final_Revised.pdf|39|e) In case a student has submitted thesis before 5 years of registration, the Institute Assistantship may continue on the recommendation of DPGC and approval of Dean (Academic Affairs) upto 5 years or
202001161251243550PG-Ordinance Final_Revised.pdf|40|There is a provision for admission to Ph.D. programmes for candidates who fulfill the eligibility criteria for the respective programmes and also have qualified in any of the national level JRF/SRF te
202001161251243550PG-Ordinance Final_Revised.pdf|41|off. They will be recommended by DPGC to register for the programme at the next available semester. Such candidates who are applying for admission in response to this advertisement for the current ses
202001161251243550PG-Ordinance Final_Revised.pdf|42|programmes, provided he/she satisfies the eligibility criteria laid down for the programme concerned (see Sec. B.1 and Table 3 Annexure-II). Such a candidate must show satisfactory performance in the 
202001161251243550PG-Ordinance Final_Revised.pdf|43|km from the Institute). The requirement of earning credits through course work shall be waived off 12 | P a ge by Dean (Academic Affairs) on the recommendation of DPGC provided the candidate has M.Tec
202001161251243550PG-Ordinance Final_Revised.pdf|44|the time of interview.] In addition, an R&D organization/industry or a research area in the specific organization may be recognised by the Institute as per the following procedure. On the recommendati
202001161251243550PG-Ordinance Final_Revised.pdf|45|considered only if he/she wishes to work in the approved area. 2.4.B.1.6 Full Time Sponsored Registration Category A candidate who is sponsored by a teaching institution or by an R&D organization or b
202001161251243550PG-Ordinance Final_Revised.pdf|46|candidate and to relieve him/her to pursue the programme for its full duration. Such candidates have to complete the requirements of the programme by staying on-campus for the full duration of the pro
202001161251243550PG-Ordinance Final_Revised.pdf|47|Institute as well as research assistants/JRFs/SRFs working in an externally funded research project running in the Institute, provided they satisfy the eligibility criteria laid down for the programme
202001161251243550PG-Ordinance Final_Revised.pdf|48|pursues the programme while continuing the duties of his/her service provided the sponsoring institution/organization is located within a distance of 50 km from the Institute and engaged in broad area
202001161251243550PG-Ordinance Final_Revised.pdf|49|at the time of written test/interview. In addition, the candidate must submit an undertaking that 13 | P a ge he/she shall continue to submit Form 16 for the subsequent years till he/she completes the
202001161251243550PG-Ordinance Final_Revised.pdf|50|Department/ School as nominee of Dean (Academic Affairs). Chairperson of the Committee shall be appointed by DPGC. The constitution of the selection committee will be proposed by the DPGC and approved
202001161251243550PG-Ordinance Final_Revised.pdf|51|4. For Full time regular category, candidates shortlisted on the basis of GATE Score which is valid and above the qualifying pass mark, may be selected for M.Tech.. programmes either on the basis of t
202001161251243550PG-Ordinance Final_Revised.pdf|52|this merit list. Remaining qualified applicants shall be allotted seats category-wise. 6. Candidates for whom results of the qualifying examination are not declared at the time of written test/intervi
202001161251243550PG-Ordinance Final_Revised.pdf|53|by the last date for document submission as mentioned in the academic calendar (usually about 8 weeks from the date of registration), failing which their admission shall be cancelled. 7. Upon approval
202001161251243550PG-Ordinance Final_Revised.pdf|54|fails to register by the date for late registration. 2.5.2 Ph.D. Programme 1. The applicants must apply for admission to Ph.D. programmes when advertised by the Institute. 2. All admissions will be ma
202001161251243550PG-Ordinance Final_Revised.pdf|55|3. The selection committee may form separate sub-committees, if necessary, to select candidates belonging to different categories, viz., sponsored, QIP, etc. It is necessary to prepare separate merit 
202001161251243550PG-Ordinance Final_Revised.pdf|56|b) Sponsored Registration Category c) Part-time Registration Category d) Candidates having National Level Scholarships e) Outstanding candidates from Premier Institution: i) Applicants who have qualif
202001161251243550PG-Ordinance Final_Revised.pdf|57|Test for remaining candidates; v) Any candidate who could not qualify in the said Interview, through this channel, is eligible to take regular selection procedure of Written Test and Interview. Since,
202001161251243550PG-Ordinance Final_Revised.pdf|58|prepared and the seats allocated to the Open Category shall be filled up in order of merit from this merit list. Remaining qualified applicants shall be allotted seats category-wise. 8. Candidates for
202001161251243550PG-Ordinance Final_Revised.pdf|59|having passed the qualifying degree examination with at least the minimum marks for eligibility by the last date for document submission as mentioned in the academic calendar (usually about 8 weeks fr
202001161251243550PG-Ordinance Final_Revised.pdf|60|in the waiting list, if any, in order of merit. Note: 1. Mere fulfilment of eligibility criteria does not guarantee admission in a programme. The candidates’ performance in the written test and interv
202001161251243550PG-Ordinance Final_Revised.pdf|61|processed by the departments as and when they are received or according to any schedule convenient to the departments. The applications should be scrutinized to make sure that, in terms of qualificati
202001161251243550PG-Ordinance Final_Revised.pdf|62|Note: Candidates belonging to the above two categories should satisfy the eligibility conditions laid down in section 2.4 and should have qualified GRE. Any non-GRE qualified candidate, may also be co
202001161251243550PG-Ordinance Final_Revised.pdf|63|university in India or abroad, and who is officially sponsored by that Institute or university to complete part of his/her academic requirements at RGIPT. For that purpose the non-degree student may c
202001161251243550PG-Ordinance Final_Revised.pdf|64|Department should not be more than 5% of the sanctioned strength. 3. Students so admitted will be governed by all rules, regulations and discipline of the Institute and shall pay registration fee pres
202001161251243550PG-Ordinance Final_Revised.pdf|65|16 | P a ge i) Submitting a duly filled proforma (as per Section 4.2) to be followed in the semester to the Academic Office, after approval by the DPGC concerned. The student may also fill the Registr
202001161251243550PG-Ordinance Final_Revised.pdf|66|2. A new entrant (to the postgraduate programme) who is awaiting the results of the qualifying examination, will be allowed to register "provisionally" on submission of a certificate from his/her inst
202001161251243550PG-Ordinance Final_Revised.pdf|67|3. All students who are not on authorized leave must continue to register in the following semester till they submit their thesis. However, if a student submits his/her thesis on or before the last da
202001161251243550PG-Ordinance Final_Revised.pdf|68|Section 2.7.] 5. Ph.D. students who have submitted their thesis and are waiting for the defence of the thesis may register for zero credits. They may, however, apply for leave from the Institute with 
202001161251243550PG-Ordinance Final_Revised.pdf|69|employees of RGIPT and QIP students registered for the Ph.D. programmes who have completed the course and thesis credit requirements and the prescribed residence period may not register in the followi
202001161251243550PG-Ordinance Final_Revised.pdf|70|9. A student under the external registration category, who has completed the minimum residence requirements can register for thesis credits during the period starting from one week prior to the end of
202001161251243550PG-Ordinance Final_Revised.pdf|71|17 | P a ge calendar along with late registration fee as specified by the Institute. No late registration is permitted for the summer term [IC: Section 4.4.]. 2. In exceptional cases, the Chairman, Se
202001161251243550PG-Ordinance Final_Revised.pdf|72|according to sub-clause 1 and 2 above. 4. Late registrations due to prolonged summer internships are not permitted beyond the date specified for late registration in the Academic Calendar. In case the
202001161251243550PG-Ordinance Final_Revised.pdf|73|must have a thesis supervisor assigned to him/her. 3.3. Semester Load Requirements 1. A semester load is defined as equivalent of about 55 credits. A student registering solely for thesis work, may re
202001161251243550PG-Ordinance Final_Revised.pdf|74|2. The normal semester load for a part-time student is equivalent of 33 credits. For a well-merited case, the Dean (Academic Affairs) may permit a part-time student to register for a maximum of 44 cre
202001161251243550PG-Ordinance Final_Revised.pdf|75|4. A student is normally expected to register for thesis credits only after completing the course work requirements. However, to fulfil the semester load requirements, a student may be permitted by th
202001161251243550PG-Ordinance Final_Revised.pdf|76|maximum of 3 Theory courses) including courses from all previous Semesters. A student cannot register for a course in summer term, if the course is not offered. [IC: Section 7.4] 18 | P a ge 3.5. Addi
202001161251243550PG-Ordinance Final_Revised.pdf|77|summer term. 2. Also, a student may be required to drop a course at any stage if it is determined that he/she does not fulfil the prerequisites for the course, or if a timetable clash exists which doe
202001161251243550PG-Ordinance Final_Revised.pdf|78|satisfaction of the DPGC, but the reduced load shall not be less than the minimum semester load (specified in Section 4.3). A student in the first semester of his/her academic programme and on full se
202001161251243550PG-Ordinance Final_Revised.pdf|79|recommendation of DPGC and with the approval of Dean (Academic Affairs). Since this is a change of programme, Section 2.3 rules are not automatically applicable. Instead, one of the following two cond
202001161251243550PG-Ordinance Final_Revised.pdf|80|specified in Section 2.3.3/2.3.4/2.3.6 but completes three semesters of the M. Tech. programme, (ii) completes the course work prescribed for the M. Tech. programme, and (iii) obtains a CPI of at leas
202001161251243550PG-Ordinance Final_Revised.pdf|81|3.7. Change of Registration from Full-Time to External Registration Programme If a student, admitted to M.Tech.. programme as a full time regular student, gets a professional employment after completi
202001161251243550PG-Ordinance Final_Revised.pdf|82|carrying out the thesis work at the organization and (ii) the consent of a prospective external 19 | P a ge supervisor (along with his/her bio-data) from the organization before availing this facility
202001161251243550PG-Ordinance Final_Revised.pdf|83|prospective organization, provided the organization is one of the approved organizations by the Institute listed in Annexure – IV. Such a student has to submit (i) the consent of the organization for 
202001161251243550PG-Ordinance Final_Revised.pdf|84|recommendation of DPGC and approval of the Chairman, Senate to do his/her thesis work at the prospective organization provided the DPGC approves that the organization has infrastructure/facility to ca
202001161251243550PG-Ordinance Final_Revised.pdf|85|He/she will register for every semester will he/she submits the thesis work. The M. Tech. Thesis Oral Examination Committee shall be constituted as provided in the PG Ordinance with the external super
202001161251243550PG-Ordinance Final_Revised.pdf|86|from discussions in the classroom may not be attainable merely from textbooks. The attendance is an Institute requirement and needs to be fulfilled on a course by course basis. The student is expected
202001161251243550PG-Ordinance Final_Revised.pdf|87|be calculated on the absolute number, rounded off to the next higher integer of the actual number of classes held in a course. Further, relaxation of seven days be provided to a student who has obtain
202001161251243550PG-Ordinance Final_Revised.pdf|88|of duration less than 2 weeks shall not be considered for the above mentioned relaxation. 20 | P a ge 4.2. Leave Rules Students may be granted leave under Sections 4.2.1 and 4.2.2 on application to th
202001161251243550PG-Ordinance Final_Revised.pdf|89|Sections 4.2.1, 4.2.2 and 4.2.3 may be sanctioned by Dean (Academic Affairs) on the recommendation of DPGC and it will entail loss of financial assistantship for the extended period. These leave rules
202001161251243550PG-Ordinance Final_Revised.pdf|90|semester but not from one academic session to the next academic session. 2. In addition, a student may be allowed casual leave for up to 8 days per semester subject to the condition that such leave wi
202001161251243550PG-Ordinance Final_Revised.pdf|91|maximum of 8 days. However, at a stretch, the medical leave shall not exceed 15 days. Such leave shall not entail any loss of financial assistantship. 4.2.3. Maternity Leave A female student may be gr
202001161251243550PG-Ordinance Final_Revised.pdf|92|serious medical reasons such period will be excluded in counting the total period. 4.2.4. Semester Leave Semester leave for up to a maximum of two semesters for M. Tech., and Ph.D. students may be san
202001161251243550PG-Ordinance Final_Revised.pdf|93|not be granted except for the cases mentioned in Section 4.2.5. 21 | P a ge 4.2.5. Leave for Professional Employment If a student admitted to M. Tech. programme gets a professional employment after co
202001161251243550PG-Ordinance Final_Revised.pdf|94|allowed to continue in the programme. This provision also exists for a student admitted to the Ph.D. programme, who has given the state-of- the-art seminar and who has completed the minimum residence 
202001161251243550PG-Ordinance Final_Revised.pdf|95|programme. A student, who have completed the requirement for Course Work within two semesters or at the earliest at the end of the First Semester and may give SOTA before the end of the Semester in wh
202001161251243550PG-Ordinance Final_Revised.pdf|96|from the designated medical officer of the Institute. If he/she falls ill outside the campus while on sanctioned leave, the medical certificate must be obtained from a registered medical practitioner.
202001161251243550PG-Ordinance Final_Revised.pdf|97|4.2.8. Absence without Sanctioned Leave Absence without sanctioned leave will entail loss of financial assistantship for the period of absence, and may result in the termination of the student's progr
202001161251243550PG-Ordinance Final_Revised.pdf|98|non-degree students is available. Rules and procedures to be followed for availing this provision are as follows: i) An M. Tech. or a Ph.D. student who satisfies the minimum conditions laid down in pa
202001161251243550PG-Ordinance Final_Revised.pdf|99|an application to the Dean (Academic Affairs) through the DPGC, duly supported by a statement of purpose to undertake the proposed work and sufficient information about the Department/Institution for 
202001161251243550PG-Ordinance Final_Revised.pdf|100|academic credit on his/her return. v) Permission to proceed to an institution as a non-degree student does not imply that the student will automatically get any waiver from the academic requirements o
202001161251243550PG-Ordinance Final_Revised.pdf|101|recommendations to the Dean (Academic Affairs) after determining by whatever means it deems fit, the equivalent RGIPT courses/requirements for which the student may be given a waiver. viii) On the rec
202001161251243550PG-Ordinance Final_Revised.pdf|102|unchanged for Ph.D. students but may be reduced by one semester for M. Tech. students, provided they spend at least one semester duration or two quarters of at least 6 weeks duration each as non-degre
202001161251243550PG-Ordinance Final_Revised.pdf|103|fellowship programme or MoU signed by the Institute/GoI and they will be governed by the norms/procedures as specified by DAAD or according to the MoU. 5.2. Permission to Proceed for Academic Activiti
202001161251243550PG-Ordinance Final_Revised.pdf|104|DPGC of the Department concerned, with intimation to Dean (Academic Affairs), based on an application duly forwarded by the supervisor(s). If such permission is required for a period longer than 30 da
202001161251243550PG-Ordinance Final_Revised.pdf|105|semester (exceptional cases one year may be approved by the Chairman, Senate) to make use of the special facilities or expertise available at such places. While making such special recommendations DPG
202001161251243550PG-Ordinance Final_Revised.pdf|106|6. ACADEMIC REQUIREMENTS 6.1. Minimum Residence, Maximum Duration and Academic Requirements The following Table lists the minimum residence and maximum duration allowed in the programme, and credit re
202001161251243550PG-Ordinance Final_Revised.pdf|107|"Course Work" includes only postgraduate course credits as well as permitted undergraduate course credits (up to a maximum number of 2 courses of level 4), unless stated otherwise. To satisfy the "Min
202001161251243550PG-Ordinance Final_Revised.pdf|108|Ph.D. for students with 220 44 110 4 4 Semesters 6 Years3 M.Tech. Ph.D. for students with 275 66 110 6 5 Semesters 6 Years3 M.Sc. PH.D. for students with 330 88 110 8 6 Semesters 7 Years B.Tech./4 yr.
202001161251243550PG-Ordinance Final_Revised.pdf|109|24 | P a ge 3. Add an additional year in case of part-time/external students. 4. If requirement of minimum course credits is waived off, a student under external registration will have to earn the tot
202001161251243550PG-Ordinance Final_Revised.pdf|110|Calculation of credits for M. Tech. and Ph.D. Programmes: The credits assigned for the course work is given by C = 3L + 2T + P where L indicates the number of lecture hours per week, T indicates the n
202001161251243550PG-Ordinance Final_Revised.pdf|111|courses shall not be shown either on the registration form or on the grade report. 6.4. Evaluation of Academic Performance in a Course 1. In each course a student is registered, he/she earns certain a
202001161251243550PG-Ordinance Final_Revised.pdf|112|(i) End Semester Examination 50 (ii) Mid Semester Examination 20 (iii) Laboratory Work 20 (iv) Quizzes/short tests, tutorials, assignments 10 Total 100 (b) Theory Courses without Laboratory: (i) End S
202001161251243550PG-Ordinance Final_Revised.pdf|113|committee to act as the Convener of the committee. For subjects requiring class room instructions the Coordination Committee shall consist of all the teachers involved in teaching and conducting class
202001161251243550PG-Ordinance Final_Revised.pdf|114|(b) The CCC* shall have the following functions during the semester. i) Planning and coordination of teaching theory as well as practical subjects. ii) Scheduling home assignments, quizzes, tutorials,
202001161251243550PG-Ordinance Final_Revised.pdf|115|semester. b) Question paper should be designed in a manner that it contain the questions of varying difficulty levels. For example: Paper should have the fair balance of questions containing direct qu
202001161251243550PG-Ordinance Final_Revised.pdf|116|v) Evaluation of Answer books and preparation of final marks list and submission of grades to the Examination Section, Office of Dean (Academic Affairs). * If only one teacher is involved in teaching,
202001161251243550PG-Ordinance Final_Revised.pdf|117|F 0 Fail (Extremely low level of learning) S --- (Research Unit) Satisfactory X --- (Research Unit) Unsatisfactory I --- Incomplete T --- Waiver/ Transfer Z 0 Deregistered from Course 3. If a student 
202001161251243550PG-Ordinance Final_Revised.pdf|118|make-up end semester examination shall be conducted and the grade I shall be replaced by the grade obtained by the student, as per the provisions of this document. An I grade must be converted by the 
202001161251243550PG-Ordinance Final_Revised.pdf|119|elective course, he/she can substitute the same by another elective course with the permission of the Convener, DPGC. 5. If an M. Tech. student does not secure a CPI of at least 6.0 at the end of a se
202001161251243550PG-Ordinance Final_Revised.pdf|120|course (if it is an elective course) by another elective course with the permission of the Convener, DPGC. 27 | P a ge Whenever a student is permitted to repeat or substitute a course, the new letter 
202001161251243550PG-Ordinance Final_Revised.pdf|121|each thesis unit if the work is satisfactory/unsatisfactory, as the case may be. At the end of the semester, the Research Progress Evaluation Committee (RPEC) (Section 11.2.1) appointed for the purpos
202001161251243550PG-Ordinance Final_Revised.pdf|122|4 44 4S, 3S+1X, 2S+2X, 1S+3X or 4X 3 33 3S, 2S+1X, 1S+2X or 3X 2 22 2S, 1S+1X or 2X 1 11 1S or 1X 0 0 0S+0X 7. If a student is on leave for a part of the semester or submits his/her thesis in the midd
202001161251243550PG-Ordinance Final_Revised.pdf|123|in courses credited and describes his/her academic performance in a semester. If the grade points associated with the letter grades awarded to a student are G , G , G , G , and G in five courses and 1
202001161251243550PG-Ordinance Final_Revised.pdf|124|28 | P a ge n C G i i CPI i1 n C i i1 where C , C , etc. are the credits for the courses that the student has registered for all the semesters 1 2 including the summer terms completed and G , G 
202001161251243550PG-Ordinance Final_Revised.pdf|125|the Dean (Academic Affairs) duly forwarded by the Convener, DPGC for a make-up examination within two days of the date of the scheduled examination. Such a request must, however, be made on a prescrib
202001161251243550PG-Ordinance Final_Revised.pdf|126|requested prolongs the make-up examination may be conducted at a suitable date but well before the date of registration for the next semester. [Senate Resol. No. 13.6.7] 6.7. Academic Performance Requ
202001161251243550PG-Ordinance Final_Revised.pdf|127|4. If a student, at the end of the summer term after the second semester, fails to earn at least 50% of the total credits of the cumulative load up to that point, he/she shall be deemed to have earned
202001161251243550PG-Ordinance Final_Revised.pdf|128|he/she has repeated. The duration of the Institute Assistantship also will normally be limited to the stipulated period mentioned during the award of the fellowship. 5. The DPGC will also keep a watch
202001161251243550PG-Ordinance Final_Revised.pdf|129|8. The cases of termination of the programme of such students will be presented to the Senate by the Dean (Academic Affairs) based on the recommendation of the DPGC concerned. 9. The termination lette
202001161251243550PG-Ordinance Final_Revised.pdf|130|completed two-and-half years (excluding the period of sanctioned leave, if any) in the programme; (iii) the request is approved by the Senate on the recommendations of DPGC and Dean (Academic Affairs)
202001161251243550PG-Ordinance Final_Revised.pdf|131|comprehensive examination only after he/she has completed the course requirements and satisfied the minimum specified CPI requirement. If the requirement of course credit is waived off for a student r
202001161251243550PG-Ordinance Final_Revised.pdf|132|the fifth semester after their first registration. Students admitted with M. Tech. or equivalent degrees may appear in the comprehensive examination earliest at the end of the first semester, but must
202001161251243550PG-Ordinance Final_Revised.pdf|133|Department. There may be two faculty members from outside the Department/ School in case the co-supervisor is from outside the Department. In case of external registration candidates, the external sup
202001161251243550PG-Ordinance Final_Revised.pdf|134|be the Chairman of the board. 5. A student will be considered to have passed the comprehensive examination if all the members (with the exception of at the most one member) of the board are satisfied 
202001161251243550PG-Ordinance Final_Revised.pdf|135|Students can register for Thesis Credits in any semester once supervisor(s) is (are) allotted but normally after the course work is over. However, they should complete their Comprehensive and give SOT
202001161251243550PG-Ordinance Final_Revised.pdf|136|required to give their SOTA at the end of the semester in which they registered for thesis credits first time. In addition they should clear their comprehensive during the subsequent semester. 7. The 
202001161251243550PG-Ordinance Final_Revised.pdf|137|degree after he/she has completed the course requirements for the degree with at least the minimum required CPI, and has passed the comprehensive examination. Only such students who are admitted to th
202001161251243550PG-Ordinance Final_Revised.pdf|138|seminar must be given before the end of the semester in which the student had registered for thesis credits first time. A report of satisfactory completion of this requirement is to be communicated to
202001161251243550PG-Ordinance Final_Revised.pdf|139|shall be from the sponsoring organization, who shall be referred to as external supervisor. 31 | P a ge 2. The supervisor(s) will normally be appointed at the end of the first semester for M. Tech. st
202001161251243550PG-Ordinance Final_Revised.pdf|140|students admitted in a particular semester, who will advise on the selection of courses, oversee the performance and credit requirements of each one of that batch of students. 3. Thesis supervisor(s) 
202001161251243550PG-Ordinance Final_Revised.pdf|141|INSPIRE may be permitted to supervise a Ph.D. student or M. Tech.. student only if it is a Joint Supervision along with an identified Co-Supervisor. The Supervisor and Co-Supervisor together are requi
202001161251243550PG-Ordinance Final_Revised.pdf|142|contract. For guidance of M. Tech.. student, he/she may guide independently as Supervisor, if his/her tenure permits. Visiting Faculty, who wish to participate in the research activities of the Depart
202001161251243550PG-Ordinance Final_Revised.pdf|143|Supervisor and Co-Supervisor together are required to submit an undertaking that they are jointly working in the area and after retirement of the Supervisor, the Co-Supervisor who is fully conversant 
202001161251243550PG-Ordinance Final_Revised.pdf|144|supervisor under consideration will be sent to the Chairman, Senate for approval. Such an employee can be appointed as supervisor/co-supervisor for only one Ph.D. student at a time. 5. In exceptional 
202001161251243550PG-Ordinance Final_Revised.pdf|145|submitted earlier than three months and the Ph.D. thesis will not be submitted earlier than six months from the date of such a change. 8. If a student’s supervisor proceeds on long leave for more than
202001161251243550PG-Ordinance Final_Revised.pdf|146|DPGC may appoint a programme coordinator to take care of the various formalities. 10. If all research work and related analysis are complete except for writing and submission of the thesis, and the su
202001161251243550PG-Ordinance Final_Revised.pdf|147|appointed as a supervisor for a Ph.D. student. However, he/she can be appointed as a co- supervisor for a Ph.D. student and Supervisor for M. Tech. student. 13. In such extra-ordinary situations as an
202001161251243550PG-Ordinance Final_Revised.pdf|148|Department where a matching research area exists and a faculty member is willing to supervise the student. The two DPGCs concerned should come to a mutual agreement. The matter should be sent to Chair
202001161251243550PG-Ordinance Final_Revised.pdf|149|10.2. Constitution of Committees/Boards for Thesis and Oral Examination 10.2.1. Research Progress Evaluation Committee The Research Progress Evaluation Committee (RPEC) for a Ph.D. student consists of
202001161251243550PG-Ordinance Final_Revised.pdf|150|supervisor(s)/programme coordinator in consultation with the Head of the Department concerned. It will be recommended by the DPGC and approved by the Dean (Academic Affairs). 33 | P a ge 2. The commit
202001161251243550PG-Ordinance Final_Revised.pdf|151|from the Institute; in which one is from the department and one is form outside of the Department, and Supervisor constitute the Thesis board of a PhD candidate. Unless some special circumstances make
202001161251243550PG-Ordinance Final_Revised.pdf|152|of examiners consisting of at least six names for the thesis board (in addition to the thesis supervisor(s)). This list, along with an adequate number of copies of the synopsis (prepared according to 
202001161251243550PG-Ordinance Final_Revised.pdf|153|iii) The Chairman, Senate in consultation with the Dean (Academic Affairs) will select the members of the thesis board from this list. If considered necessary, the Chairman, Senate may require additio
202001161251243550PG-Ordinance Final_Revised.pdf|154|completion of the thesis evaluation. However, on completion of Ph.D. thesis evaluation (as detailed in Section 10.4.3), the Academic Section will send to the thesis supervisor(s) the names of the Inst
202001161251243550PG-Ordinance Final_Revised.pdf|155|thesis board) and one shall be from among the members of the thesis board within the country but outside the Institute. Of the three members from RGIPT at least one shall be from a Department, which i
202001161251243550PG-Ordinance Final_Revised.pdf|156|one for each examiner of the oral board, (prepared according to the format prescribed in the “Specification and Information Regarding the Preparation of Thesis”, as per Annexure-VI), will be submitted
202001161251243550PG-Ordinance Final_Revised.pdf|157|of the satisfactory completion of the open seminar has been received. Bound copies of the Ph.D. thesis (prepared according to the format prescribed in the “Specification and Information Regarding the 
202001161251243550PG-Ordinance Final_Revised.pdf|158|In addition to the above, Quality Journal may be classified as those Journals indexed by SCI/SCI Extended/SCOPUS. The requirement of publication of two papers be fulfilled by all the Ph.D. students, i
202001161251243550PG-Ordinance Final_Revised.pdf|159|considered by the Senate and in case the Senate grants the request it shall specify the requirements that the student must fulfil for the award of the degree. 2. The thesis supervisor will intimate th
202001161251243550PG-Ordinance Final_Revised.pdf|160|have been rejected. Upon acceptance, the candidate is expected to submit the bound copies to the Office of the Dean (Academic Affairs) incorporating corrections, if any, normally within one week of th
202001161251243550PG-Ordinance Final_Revised.pdf|161|35 | P a ge 10.4.2. Open Seminar of Ph.D. Students Before proceeding to finalize the thesis, each Ph.D. student must deliver a seminar open to faculty and students in which the research work will be p
202001161251243550PG-Ordinance Final_Revised.pdf|162|DPGC. 10.4.3. Ph.D. Thesis Evaluation by the Thesis Board 1. After the synopsis has been submitted and the thesis board constituted, the Dean (Academic Affairs) will send a letter by e-mail/fax to eac
202001161251243550PG-Ordinance Final_Revised.pdf|163|In case the Examiners’ report is not received within six weeks of dispatch of the thesis, a reminder will be sent by the Dean (Academic Affairs) and if there is no reply from the Examiners within the 
202001161251243550PG-Ordinance Final_Revised.pdf|164|The supervisor(s) can use their discretion regarding incorporation of such suggestions. ii) Category II: An examiner points out minor technical mistakes, raises some queries or suggests modifications 
202001161251243550PG-Ordinance Final_Revised.pdf|165|(Academic Affairs) will inform the examiner(s) concerned, the responses by the candidate to the comments made by the Examiner(s). iii) Category III: An examiner does not recommend acceptance of the th
202001161251243550PG-Ordinance Final_Revised.pdf|166|the thesis, if any, in response to the examiner's comments along with an explanatory note which will be sent to the examiner (by the Dean (Academic Affairs)) with a request to respond within six weeks
202001161251243550PG-Ordinance Final_Revised.pdf|167|6. On completion of the process detailed above, the Dean (Academic Affairs) will intimate the supervisor the concurrence of the Chairman, Senate, if given, to initiate the constitution of the oral boa
202001161251243550PG-Ordinance Final_Revised.pdf|168|of the Oral Board with a covering letter asking to constitute the oral board, under a copy to the concerned Head of the Department. However, he would send only the copy of the covering letter to the c
202001161251243550PG-Ordinance Final_Revised.pdf|169|in his/her place, in consultation with the thesis supervisor(s)/programme coordinator, Head of the Department and Dean (Academic Affairs). 3. Each member of the oral board will be given a copy of the 
202001161251243550PG-Ordinance Final_Revised.pdf|170|have been satisfactory, and vi) give a report of the examination, which will be communicated by the supervisor(s) to the Dean (Academic Affairs) through the Convener, DPGC. 5. If all, except at most o
202001161251243550PG-Ordinance Final_Revised.pdf|171|criteria laid down above but will not recommend holding a third oral examination. ii) the candidate is declared to have failed. 7. On receipt of the report that the student has passed the oral examina
202001161251243550PG-Ordinance Final_Revised.pdf|172|10.5. Date of Award for Ph.D. Degree: The date of award of the Ph.D. degree shall be the same as the date of submission of the thesis, if the thesis is accepted without revision. If any examiner has a
202001161251243550PG-Ordinance Final_Revised.pdf|173|number of total credits prescribed for the programme, iv) satisfied the minimum residence requirements, v) satisfied all the requirements specified by the concerned Department, if any, vi) satisfied t
202001161251243550PG-Ordinance Final_Revised.pdf|174|Notwithstanding anything contained in these ordinances, the Senate of the Rajiv Gandhi Institute of Petroleum Technology, Jais reserves the right to modify/amend without notice, the curricula, procedu
202001161251243550PG-Ordinance Final_Revised.pdf|175|Convener to be nominated by the Head of the Department/Coordinator of the School in consultation with the faculty of the Department, the Head of the Department/Coordinator of the School and a minimum 
202001161251243550PG-Ordinance Final_Revised.pdf|176|four additional student members, of whom two shall be from the Ph.D. programme, and two shall be from the M.Tech. programme. The student members shall be nominated by the Students’ Senate. The Dean (A
202001161251243550PG-Ordinance Final_Revised.pdf|177|presentation and disposal of theses, the conduct of oral and written examinations and in such other related matters as may be referred to it by the Senate. The functions of the SPGC shall consist prim
202001161251243550PG-Ordinance Final_Revised.pdf|178|decision. 39 | P a ge ANNEXURE - II Table 1: M.Tech. Programmes and the Specializations A. Programmes in the Engineering Disciplines Programmes Specialization M.Tech. in Petroleum Engineering Reservoi
202001161251243550PG-Ordinance Final_Revised.pdf|179|below may be considered for admission, based on the performance in written test and/or interview and provided that the interview/admission committee, upon scrutiny of the list of courses done and cred
202001161251243550PG-Ordinance Final_Revised.pdf|180|Engg./Petrochemical Engg./Chemical Technology/Oil Technology/Paint Technology/Plastic Technology/Polymer Technology/Bio-Technology/Food Technology with a valid GATE score in Chemical Engineering NOTE:
202001161251243550PG-Ordinance Final_Revised.pdf|181|to each of their other preferred Departments. 2. Not more than 40% of the total seats in the Departments, wherever candidates from allied disciplines are declared eligible for admission, shall be open
202001161251243550PG-Ordinance Final_Revised.pdf|182|Most of the Bachelor’s and Master’s degrees that are being awarded in the disciplines/areas in the country and abroad are listed in the following. However, a candidate possessing a degree that does no
202001161251243550PG-Ordinance Final_Revised.pdf|183|Petroleum Petroleum Engineering Master’s degree in geoscience, geophysics, geology, Engineering and and Geosciences geoinformatics Geosciences Bachelors or Master’s Degree in Engineering/Technology in
202001161251243550PG-Ordinance Final_Revised.pdf|184|score of GATE/NET exam, taken before or after master degree. M.Sc.(Engg.)/M.E./M.Tech. degree in Applied Mechanics, Mining Department of Engineering, Chemical Engineering, Chemical Engineering and Che
202001161251243550PG-Ordinance Final_Revised.pdf|185|Science and Engineering, Environmental Science and Technology. M.Sc./M.Tech. in Geophysics, Geology. Electrical Engineering B.Tech. & M.Tech. in Electronics Engineering. Bachelors or Master’s Degree i
202001161251243550PG-Ordinance Final_Revised.pdf|186|Applied Chemistry/ Biochemistry/ Biotechnology/ Medicinal Chemistry Chemistry/ Materials Science & Technology/ Environmental Science and Nano Technology with chemistry as a subject at Bachelor Level. 
202001161251243550PG-Ordinance Final_Revised.pdf|187|Department of Basic Mechanical Engg., Mathematics, Chemistry, Remote Sensing, Sciences & Astrophysics, Space Physics, Applied Optics, Atmospheric Physics, Fibre Optics & Photonics, Nanotechnology and 
202001161251243550PG-Ordinance Final_Revised.pdf|188|Chemical Engineering photocatalysis, membranes, crystallization, microfluidics, polymers, nanomaterials. Petroleum Engineering Enhanced oil recovery, nanodrilling fluids, gas hydrates, prospecting, so
202001161251243550PG-Ordinance Final_Revised.pdf|189|a) English (Literature, Professional Communication, Cultural Studies, Film Studies, Narrative Studies) b) Philosophy (Indian and Western Logic, Peace and Ahimsa Studies, Gandhian Philosophy, Value Edu
202001161251243550PG-Ordinance Final_Revised.pdf|190|Management Marketing, Organizational Behavior, HRM, Oil & Gas, Public Policy, Energy Management & Economics. Synthetic Chemistry, Environmental Chemistry, Surface Chemistry, Chemistry Computational Ch
202001161251243550PG-Ordinance Final_Revised.pdf|191|Modeling and Porous Media, Soft Computing, Fuzzy Sets, Algebraic Numerical Techniques, Mathematical Modeling on heat Transfer Problem. Solar & Space Plasma Physics, Condensed Matter Physics (Theory), 
202001161251243550PG-Ordinance Final_Revised.pdf|192|Geoscience Processes, Remote Sensing and Geographic Information Systems, Paleoenvironments and the Sedimentary Record, Biogeochemistry of Soil Systems, Geophysics and Structural Geology. 44 | P a ge A
202001161251243550PG-Ordinance Final_Revised.pdf|193|candidates (other than those covered under the category of “creamy layer”). The reservation is applicable to those OBC candidates who satisfy the following eligibility requirements. 1. They belong to 
202001161251243550PG-Ordinance Final_Revised.pdf|194|Training as amended by that Department vide OM No. 36033/3/2004-Estt.(Res) dated 9th March, 2004 and any other notification that may take place before the admission. More details on the definition of 
202001161251243550PG-Ordinance Final_Revised.pdf|195|PC Category In each category of seats (unreserved and reserved), 5% seats are reserved for the Physically Challenged (PC) candidates and are to be filled up as per the admission procedure laid down fo
202001161251243550PG-Ordinance Final_Revised.pdf|196|45 | P a ge ANNEXURE III.1 (Format of SC/ST Certificate) FORM OF THE CERTIFICATE TO BE PRODUCED BY SCHEDULED CASTE AND SCHEDULED TRIBE CANDIDATES IN SUPPORT OF THEIR CLAIM 1. This is to certify that S
202001161251243550PG-Ordinance Final_Revised.pdf|197|*The Constitution (Scheduled Tribes) (Union Territories) Order, 1951 [As amended by the Scheduled Castes and Scheduled Tribes Lists (Modification Order) 1956, the Bombay Reorganisation Act, 1960, the 
202001161251243550PG-Ordinance Final_Revised.pdf|198|*The Constitution (Dadara and Nagar Haveli) Scheduled Castes, Order, 1962; *The Constitution (Dadara and Nagar Haveli) Scheduled Tribes, Order, 1962; *The Constitution (Pondicherry) Scheduled Castes O
202001161251243550PG-Ordinance Final_Revised.pdf|199|*The Constitution (Scheduled Tribes) Order (Amendment) Act, 1991; *The Constitution (Scheduled Tribes) Order (Second Amendment) Act, 1991; 2. This certificate is issued on the basis of the Scheduled C
202001161251243550PG-Ordinance Final_Revised.pdf|200|3. Shri/Shrimati/Kumari* ______________________ and/or* his/her* family ordinarily reside(s)** in village/town* ____________ of ___________ District/Division* of the State/Union Territory* of ________
202001161251243550PG-Ordinance Final_Revised.pdf|201|(i) District Magistrate/Additional District Magistrate/Collector/Deputy Commissioner/Additional Deputy Commissioner/Deputy Collector/1st Class Stipendiary Magistrate/City Magistrate/Sub- Divisional Ma
202001161251243550PG-Ordinance Final_Revised.pdf|202|47 | P a ge ANNEXURE III.2 (Format of OBC Certificate) FORM OF CERTIFICATE TO BE PRODUCED BY OTHER BACKWARD CLASSES APPLYING FOR ADMISSION TO CENTRAL EDUCATION INSTITUTES UNDER THE GOVERNMENT OF INDIA
202001161251243550PG-Ordinance Final_Revised.pdf|203|(ii) Resolution No. 12011/9/94-BCC dated 19/10/94 published in the Gazette of India Extraordinary Part I Section I No. 163 dated 20/10/94. (iii) Resolution No. 12011/7/95-BCC dated 24/05/95 published 
202001161251243550PG-Ordinance Final_Revised.pdf|204|Part I Section I No. 270 dated 06/12/99. (x) Resolution No. 12011/36/99-BCC dated 04/04/2000 published in the Gazette of India Extraordinary Part I Section I No. 71 dated 04/04/2000. (xi) Resolution N
202001161251243550PG-Ordinance Final_Revised.pdf|205|Shri/Smt./Kum. ________________________ and/or his family ordinarily reside(s) in the __________________________ District/Division of ________________________ State. This is also to certify that he/sh
202001161251243550PG-Ordinance Final_Revised.pdf|206|Representation of the People Act, 1950. (b) The authorities competent to issue Caste Certificates are indicated below: (i) District Magistrate / Additional Magistrate / Collector / Deputy Commissioner
202001161251243550PG-Ordinance Final_Revised.pdf|207|x-x-x-x-x-x 49 | P a ge ANNEXURE III.3 RELAXATION IN THE QUALIFYING MARKS FOR SC/ST CANDIDATES A relaxation of 5% marks / 0.5 CPI shall be admissible on all qualifying marks/CPI for Scheduled Caste an
202001161251243550PG-Ordinance Final_Revised.pdf|208|of ______________ ________________________, Village/Street ___________________________ Post Office ____________ District _________________ in the State/Union Territory Pin Code ______________ whose ph
202001161251243550PG-Ordinance Final_Revised.pdf|209|IV. Residential plot of 200 sq. yards and above in. areas other than the notified municipalities. 2. Shri/Smt./Kumari ___________________________________ belongs to the ____________ caste which is not
202001161251243550PG-Ordinance Final_Revised.pdf|210|years as also his/her spouse and children below the age of IS years ***Note 3: The property held by a "Family' in different locations or different places/cities have been clubbed while applying the la
202001161251243550PG-Ordinance Final_Revised.pdf|211|Stipendiary Magistrate/ Sub-Divisional Magistrate/ Taluka Magistrate! Executive Magistrate/ Extra Assistant Commissioner (ii) Chief Presidency Magistrate/Additional Chief Presidency Magistrate/Preside
202001161251243550PG-Ordinance Final_Revised.pdf|212|3. Indian Pharmacopoeia Commission, Ghaziabad. 4. Central Mine Planning and Design Institute Limited, Ranchi. 5. Central Power Research Institute, Bangalore. 6. Central Pulp and Paper Research Institu
202001161251243550PG-Ordinance Final_Revised.pdf|213|17. Tata Steel, Jamshedpur. 18. National Metallurgical Laboratory Extension Centre, Chennai. 19. R & D Centres of various oil PSUs, and private oil companies. N.B. All the research areas in which the 
202001161251243550PG-Ordinance Final_Revised.pdf|214|c) Theory courses with 3 contact hours per week per course and two hours of additional work per week C = 3 L + 2 T + P + A = 3x3 + 0 + 0 + 2 = 9+2 = 11 d) Practical courses Assuming that one hour of p
202001161251243550PG-Ordinance Final_Revised.pdf|215|(Under Clause 11.4.2 of PG Ordinances) RAJIV GANDHI INSTITUTE OF PETROLEUM TECHNOLOGY JAIS, AMETHI 54 | P a ge GUIDELINES FOR THESIS PREPARATION This document, herein after referred to as Specificatio
202001161251243550PG-Ordinance Final_Revised.pdf|216|requirements. Checklist at the time of Thesis Submission (for Office Use) Please see Appendix – D 1.1 M.Tech. Unbound copies of the thesis, one for each examiner of the oral board (including the thesi
202001161251243550PG-Ordinance Final_Revised.pdf|217|1.2 Ph.D. An extended abstract of about 1500 words in PDF format written on a CD along with two print copies is required to be submitted one month in advance of the submission of the thesis for transm
202001161251243550PG-Ordinance Final_Revised.pdf|218|2.1.1 The thesis needs to be prepared using a standard text processing software and must be printed on both sides of the paper in black text (color for images, if necessary) using a laser printer in T
202001161251243550PG-Ordinance Final_Revised.pdf|219|2.2.2 The top and bottom margins should be 25 mm, whereas the left side margins of odd pages and right side margins of even pages should be 35 mm for both textual and non-textual (e.g., 55 | P a ge fi
202001161251243550PG-Ordinance Final_Revised.pdf|220|2.2.5 All tables and figures should conform to the same requirements as text. Color may be used for figures. If tables and figures are large, they may be reduced to the standard size (provided the red
202001161251243550PG-Ordinance Final_Revised.pdf|221|examination office of the Institute and the other for keeping in the Institute Main Library. The student may choose to submit printed copies of the thesis either in the standard size (as in 2.2.1) or 
202001161251243550PG-Ordinance Final_Revised.pdf|222|each chapter the page numbers need not be printed. 2.3.2 Page numbers prior to Chapter 1 should be in lower case Roman numerals. The title page is considered to be page (i) but the number is not print
202001161251243550PG-Ordinance Final_Revised.pdf|223|2.6 Tables, Figures and Equations 2.6.1 All Tables (tabulated data) and Figures (charts, graphs, maps, images, diagrams, etc.) should be prepared, wherever possible, on the same paper as used to type 
202001161251243550PG-Ordinance Final_Revised.pdf|224|2.6.3 If Tables and Figures are of only half a page or less, they may appear on the same page as text but separated above and below by triple line spacing. Font size for text of the Table and Figure c
202001161251243550PG-Ordinance Final_Revised.pdf|225|2.7 Binding The student should submit the copies of the thesis in soft bound form with soft cover (not spiral bound) for Ph.D. and partially bound form (spiral binding, clamping, or filing) for M.Tech
202001161251243550PG-Ordinance Final_Revised.pdf|226|The following sequence for the thesis organization should be followed: (i) Preliminaries (ii) Text of Thesis (iii) References and Bibliography (iv) Appendices All the headings are centered (without pu
202001161251243550PG-Ordinance Final_Revised.pdf|227|3.2.2 Certificates Refer to Appendix - C. 3.2.3 Acknowledgement and/or Dedication As per student's desire but they should contain only text and no photographs. 3.2.4 Table of Contents The Table of con
202001161251243550PG-Ordinance Final_Revised.pdf|228|Tables, figures and illustrations (if used in the thesis) should be listed under separate headings. 3.2.6 Symbols used Various symbols used in the Thesis should be listed along with their meaning. 3.2
202001161251243550PG-Ordinance Final_Revised.pdf|229|brief statement of the problem investigated. It should outline the objectives and scope, general character of the research and a review of the investigations already carried out in the field the thesi
202001161251243550PG-Ordinance Final_Revised.pdf|230|sequentially as they appear in the text of the thesis under the subheading “References”. If pertinent works have been consulted but not specifically cited, they should be listed under the subheading “
202001161251243550PG-Ordinance Final_Revised.pdf|231| Referencing an article published in proceedings of a conference: The suggested format should contain authors, title of the paper, name of proceedings, publisher's details, page numbers and year.  R
202001161251243550PG-Ordinance Final_Revised.pdf|232|58 | P a ge H.E. Exner, “Physical and Chemical Nature of Cemented Carbides,” International Metals Review, 1979, v. 24, pp. 149-173. OR 24(1979)149-173 [ if referencing is done on the name of first aut
202001161251243550PG-Ordinance Final_Revised.pdf|233|York, NY, USA, 1982, pp. 1-45. W.H. Baek, M.H. Hong, S. Lee, and D.T. Chung, “A Study on the Shear Localization Behavior of Tungsten Heavy Alloy,” Tungsten and Refractory Metals 2, A. Bose and R.J. Do
202001161251243550PG-Ordinance Final_Revised.pdf|234|Technical Reports E.G. Zukas, P.S.Z. Rogers, and R.S. Rogers, “Experimental Evidence for Spheroid Growth Mechanisms in the Liquid Phase Sintered Tungsten Based Composites,” Informal Report: Los Alamos
202001161251243550PG-Ordinance Final_Revised.pdf|235|3.6.1 Supplementary illustrative materials, original data, and quotations too lengthy for inclusion in the text or which is not immediately essential to an understanding of the subject can be presente
202001161251243550PG-Ordinance Final_Revised.pdf|236|Guidelines are only the basic requirements for preparing the thesis. Over and above the aforementioned points, a thesis should be reader-friendly in both its appearance and presentation. Several aspec
202001161251243550PG-Ordinance Final_Revised.pdf|237|notations, and in preparing tables, figures, etc. It is mandatory to use SI system of units. Presentation & style of writing should be in impersonal voice (i.e. to be in third person). 59 | P a ge App
202001161251243550PG-Ordinance Final_Revised.pdf|238|for the Award of "NAME OF THE DEGREE" in NAME OF DEPARTMENT by "NAME OF THE STUDENT" "NAME OF DEPARTMENT" RAJIV GANDHI INSTITUTE OF PETROLEUM TECHNOLOGY JAIS – 229304 "ROLL NUMBER OF THE STUDENT" "YEA
202001161251243550PG-Ordinance Final_Revised.pdf|239|THE STUDENT" has been carried out under my/our supervision and that this work has not been submitted elsewhere for a degree. It is further certified that the student has fulfilled all the requirements
202001161251243550PG-Ordinance Final_Revised.pdf|240|Technology, Jais. The matter embodied in this thesis has not been submitted for the award of any other degree. I declare that I have faithfully acknowledged and given credits to the research workers w
202001161251243550PG-Ordinance Final_Revised.pdf|241|It is certified that the above statement made by the student is correct to the best of my/our knowledge. Supervisor Co-Supervisor External Supervisor (Affiliation) (Affiliation) (Affiliation) Signatur
202001161251243550PG-Ordinance Final_Revised.pdf|242|It is further certified that the two publications (copies enclosed) of the aforesaid Mr./Ms. ........ ............................. have been published in the Journals indexed by – (a) SCI (b) SCI Ext
202001161251243550PG-Ordinance Final_Revised.pdf|243|Name of the Student : ................................................................................................................ Copyright Transfer The undersigned hereby assigns to the Rajiv Ga
202001161251243550PG-Ordinance Final_Revised.pdf|244|68 | P a ge Appendix - D RAJIV GANDHI INSTITUTE OF PETROLEUM TECHNOLOGY (JAIS, AMETHI) * * * FOR SUBMISSION OF PH.D. THESIS PERSONAL DETAILS Name of Student : _________________________________________
202001161251243550PG-Ordinance Final_Revised.pdf|245|_________________________________________________________________ ATTENTION NOTE : Before submission of Thesis by a student, the following be verified & completed by the Department concerned.  Minimu
202001161251243550PG-Ordinance Final_Revised.pdf|246|(Roll No. of the candidate should be mentioned on each copy)  At least 2 Research Publications in reputed Journals (Published/accepted) YES/NO  TWO copies of ABSTRACT of the thesis in about 600 word
202001161251243550PG-Ordinance Final_Revised.pdf|247|- To the effect that Specifications regarding thesis format have been followed  Copyright transfer certificate YES/NO  Whether Thesis Evaluation Board constituted and communicated to YES/NO Dean (Ac