academic-notification--8a26671da6.txt|0|A - A A + T हिंदी Toggle navigation Institute About Governance General Council Board of Governors Finance Committee Senate Director Registrar Vision and Mission Acts and Statutes RGIPT Act, 2007 RGIPT
academic-notification--8a26671da6.txt|1|Electrical and Electronics Engineering Management Studies Mathematical Sciences Mechanical Engineering Petroleum Engineering and Geoengineering Energy and Human Sciences Research Central Instrumentati
academic-notification--8a26671da6.txt|2|Alumni Affairs Faculty Affairs Non Teaching Staff Research and Development Resources and Planning Students' Affairs Faculty Faculty Honorary Adjunct Administrative Personnel Technical Personnel Counci
academic-notification--8a26671da6.txt|3|Students' Achievements Student Activity Center (SAC) Students' Downloads Teaching Assistant Allocation Time Table Campus Life Campus View Amenities FAQs Flora and Fauna Guest Hostel Hostels Training M
academic-notification--8a26671da6.txt|4|Auction / Lease / Academics / Notices/Formats/Resolutions / Notifications Academic Notifications S.No. Subject View Notification-Course Registration Process for Odd Semester, 2023-24 will closed by To
academic-notification--8a26671da6.txt|5|View Notification-Guidelines for Examination of Institute Sciences-Engineering Courses View Notification-Lateral Entry of Freshly Graduating Diploma Student of AEIS View Notification-International Stu
academic-notification--8a26671da6.txt|6|View Notification-Admission Committee 2023-24_Re-Constituted on [PHONE REDACTED] View Institute Core Course Monitoring Committee of Common UG Courses View Extension of End Semester Examination Date of
academic-notification--8a26671da6.txt|7|View Notification-Long Term Internship of 3rd Year Students-LTI View Notification-Long Term and Short Term Internship View Notification-Leave Approval and Attendance View Notification- Branch Change (
academic-notification--8a26671da6.txt|8|View Notification-Temporary Change in Time Table due to severe cold wave condition View Notification-Shifting of Time of B Tech-IDD 1st Semester View Notification-Committee Constituted at Institute Le
academic-notification--8a26671da6.txt|9|View Purchase Committee of Academic Affairs Section-2022-23 View Notification-Research Fellowship by PSUs View Appointment of PA in Projects View Notification-Relaxation in the Deposition of Semester 
academic-notification--8a26671da6.txt|10|Notification-Summer Internship Grades Submission View Notification-Incharge & Co-Incharge of UG Laboratories View Notification-Undergraduate Laboratories capacity to cater to 50 Students View Registra
academic-notification--8a26671da6.txt|11|View Discipline Change CSE to CE View Documents Verification of B.Tech. 2nd Year & M.Tech./PhD 1st Year View Number of Student Tutors Sanctioned for Tutorials in Various UG Course View Questions for T
academic-notification--8a26671da6.txt|12|Rehearsal and Assembly on 5th Convocation View Digital Learning Cell-(DLC) View Discipline Change-Lateral Entry View Guideline for Registration in Online Platform Courses MOOC-SWAYAM-NPTEL View Mode o
academic-notification--8a26671da6.txt|13|View Constitution of DPGC-Mathematical Sciences View Constitution of DPGC-Sciences and Humanities View Constitution of DUGC, DPGC and Examination In-charge Committee-CE&BE View Constitution of DPGC Co
academic-notification--8a26671da6.txt|14|View Deadline of M Tech Final Year Thesis with Examiner Report View Guideline of Online Examination-2nd Year (3rd Sem) 2019 Batch View Additional Counselors for SII Virtual Education Fair View Academi
academic-notification--8a26671da6.txt|15|View Special End Semester Examination VII and VIII fo Fourth Year B Tech View Internship Guideline for Extended or Short Term Project for Third Year B Tech View Internship Option for Third Year B Tech
academic-notification--8a26671da6.txt|16|View Constitution of Academic Purchase Committee for One Year from the date of Notification View Attendance & Leave Rules for UG & PG students View Attendance Rules described in clause 6.2 of UG & PG 
academic-notification--8a26671da6.txt|17|View Guidelines for Semester Registration View Guidelines of Conducting of Lectures of UG & PG Programmes View Constitution of M Tech & PhD Admission Committee for A.Y. 2020-21 & 2021-22 View Guidelin
academic-notification--8a26671da6.txt|18|View Responsibility to Handle Tutorials of several subjects by academically proficient senior UG students View Students’ arrival at Campus by 10th July 2020 to purse their online studies View Committe
academic-notification--8a26671da6.txt|19|View Collection of Student Online Feedback Form View Deposition of Semester Fees & Registration & Initiation of Academic Activities, B Tech & Diploma Students View Deposition of Semester Fees & Regist
academic-notification--8a26671da6.txt|20|View Protocol to Conduct the Mid Semester & End Semester Examinations followed from 2019-20 academic year, Odd Semester onwards View Guidelines of Registration for Courses in Summer Term in 2020 View 
academic-notification--8a26671da6.txt|21|View Honorarium for Tutorship View Handle the use of unfair means during various examination of UG & PG students View Constitution of Course Coordination Committee (CCC) & Distribution of Weightage fo
academic-notification--8a26671da6.txt|22|Javascipt has been disabled. Javascipt has been disabled. Javascipt has been disabled. Javascipt has been disabled. Javascipt has been disabled. Javascipt has been disabled. Javascipt has been disable