academic-scholarship-financial-assistant--f9171cfce6.txt|0|The Institute offers Merit-cum-Means scholarships to 25% undergraduate students. Besides, there are several endowment scholarships offered by the Institute. The Institute offers a large number of Juni
academic-scholarship-financial-assistant--f9171cfce6.txt|1|- His/her CPI/SPI does not fall below 6.5 and he/she does not receive any Fail grade (F, I, Z). - The candidate needs to submit family income certificate each year and the income shall not exceed the 
academic-scholarship-financial-assistant--f9171cfce6.txt|2|Documents - Income Certificate - Last Semester Grade-sheet Central Scholarship for B Tech and IDD Students The Scheme of Top Class Education for SC students has been selected for implemented through N
academic-scholarship-financial-assistant--f9171cfce6.txt|3|- Have an annual income of less than INR 6 lakh from all the sources Benefit The selected students will receive – - Full tuition fee and non-refundable charges of up to INR 2.00 lakh per annum for pri
academic-scholarship-financial-assistant--f9171cfce6.txt|4|- Fee structure of the program Guidelines Click here for Guidelines [Click Here] for Link for Application - Read the guidelines carefully on NSP Portal https://scholarships.gov.in/ - In case of any qu
academic-scholarship-financial-assistant--f9171cfce6.txt|5|- Have an annual family income of less than INR 6 lakh Benefits The selected students will receive – - Full tuition fee with a maximum ceiling of INR 2.5 lakh per annum will be covered under the schol
academic-scholarship-financial-assistant--f9171cfce6.txt|6|- Income certificate by the competent authority - Caste certificate by the competent authority - Certificate of previous academic mark sheet attested by the Institute - Fee receipt of current course y
academic-scholarship-financial-assistant--f9171cfce6.txt|7|Eligibility To be eligible, an applicant must – - The applicant must be a resident of Madhya Pradesh. - He/ She must have passed Class 12 with 70% or more marks (if appeared through Secondary Educatio
academic-scholarship-financial-assistant--f9171cfce6.txt|8|- Engineering Aspirants must have qualified JEE Main exam with a rank less than 1, 50,000. Benefit - The students enrolling in an engineering program at a government/non-government college will receiv
academic-scholarship-financial-assistant--f9171cfce6.txt|9|- Contact Number [Click here] for Guidelines [Click Here] for Link for Application - Read the guidelines carefully on UP Scholarship Portal http://scholarshipportal.mp.nic.in/Index.aspx - In case of a
academic-scholarship-financial-assistant--f9171cfce6.txt|10|- The annual income of the family should not exceed INR 2 Lakh (for General candidates) and INR 2.5 Lakh (for SC/ST candidates) from all sources. - The scholarship is applicable for minority community
academic-scholarship-financial-assistant--f9171cfce6.txt|11|Documents The candidates while filling up the application form must submit the following documents:- - Residential proof like ration card, Aadhaar card, voter ID, driving license or PAN card - Passpor
academic-scholarship-financial-assistant--f9171cfce6.txt|12|- Read the guidelines carefully on UP Scholarship & Fee Reimbursement Online Portal http://www.scholarship.up.gov.in/ - In case of any queries from the concerned department, you can contact at the fol
academic-scholarship-financial-assistant--f9171cfce6.txt|13|Benefit - Maintenance allowance of up to Rs. 7,500 per annum. Documents The candidates while filling up the application form must submit the following documents:- - Jharkhand Domicile - Aadhaar Card -
academic-scholarship-financial-assistant--f9171cfce6.txt|14|To be eligible, an applicant must – - The applicant should be a resident of Bihar state www.pmsonline.bih.nic.in. - Applicant should be studying in Post-Matriculation class. - An applicant must be stu
academic-scholarship-financial-assistant--f9171cfce6.txt|15|- If any candidate who after passing one stage of education and studying in a different subject in the same stage then they will not be eligible. Benefit - The selected students will receive financial
academic-scholarship-financial-assistant--f9171cfce6.txt|16|- Read the guidelines carefully on Bihar Post Matric Scholarship http://www.pmsonline.bih.nic.in/ - In case of any queries from the concerned department, mail can be sent at the following mail ID [EMA