Brochure_Btech_Admission 2025.pdf|0|Rajiv Gandhi Institute of Petroleum Technology An Institution of National Importance, Government of India Jais, Amethi - 229304, Uttar Pradesh, India Information Brochure BTech Admission 2025 Academic
Brochure_Btech_Admission 2025.pdf|1|which are meticulously crafted to empower the next generation of engineers and innovators. At RGIPT, we are deeply committed to excellence in education, research, and innovation. The Institute has gro
Brochure_Btech_Admission 2025.pdf|2|are a unique blend of foundational science, core engineering, and specialized electives, enabling students to tailor their academic journey based on their interests and career goals. With options for 
Brochure_Btech_Admission 2025.pdf|3|their exposure to industrial practices and innovation ecosystems. Beyond academics, life at RGIPT is full of vibrant opportunities. From our Design and Innovation Centre to the Science and Technology 
Brochure_Btech_Admission 2025.pdf|4|regularly recruited by leading PSUs, MNCs, and technology companies, many of whom return year after year owing to the high-quality human resources we nurture. RGIPT also believes in nurturing social c
Brochure_Btech_Admission 2025.pdf|5|We look forward to welcoming you to the RGIPT family—a place where knowledge meets purpose, and ambition meets opportunity. Prof. Harish Hirani Director, RGIPT The Institution The Rajiv Gandhi Institu
Brochure_Btech_Admission 2025.pdf|6|on critical and promising areas such VISION as Green Energy, Artificial Intelligence (AI), E-Vehicle, and Digitalization. For To create a dynamic state-of-the-art aspiring students, RGIPT offers a uni
Brochure_Btech_Admission 2025.pdf|7|companies within the energy sector and beyond. The Institute is associated with leading international universities and institutions specializing in the domain of Petroleum & Energy Technology. MISSION
Brochure_Btech_Admission 2025.pdf|8|These programs seek to develop sector. human resources of the highest caliber to cater to the needs of industries, R & D organizations, and academic institutions. The vision of the institute is excell
Brochure_Btech_Admission 2025.pdf|9|3.1. Centre for Computing and Information Services 5 3.2. Library 5 3.3. Laboratories 5-6 3.3.1. UG Laboratory 5 3.3.2. Central Instrumentation Facilities 6 3.4. Linkage with Industry 6 3.5. Internshi
Brochure_Btech_Admission 2025.pdf|10|8.3. Student Chapters 9 9. Extra-Curricular Activities 10–11 9.1. Sports Council 10 9.2. Social Council 10 9.3. Cultural Council 11 9.4. Alumni Association 11 10. Hostel 11-12 11. Students’ Gym Facili
Brochure_Btech_Admission 2025.pdf|11|6. How to Reach 21 Flowchart illustrating the step-by-step process of admission/ counseling, from registration to final seat allocation The Date of Round #3 will be Announced Later 1 BTech Admission 2
Brochure_Btech_Admission 2025.pdf|12|technical, analytical, and managerial etc.), humanism, social responsibility and business aptitude among the students. The goal of undergraduate engineering and technology education is that the studen
Brochure_Btech_Admission 2025.pdf|13|A B C programme is to help students gain cademic proficiency, uild character and acquire ommunication skills for holistic development. Some of the major highlights of UG program at RGIPT are: Energy i
Brochure_Btech_Admission 2025.pdf|14|Streams Flexible Currieulum Opportunity to gain specialized Flexibility to register for more knowledge in a particular domain & less numbers of courses in a semester Minor Program Opportunity to opt m
Brochure_Btech_Admission 2025.pdf|15|The Institute offers 4-year BTech programmes in the verious disciplines. Major & Minor Courses Color codes of the Minor  Chemical Engineering Courses  Computer Science & Engineering Computer Science
Brochure_Btech_Admission 2025.pdf|16| Mechanical Engineering BTech in Chemical BTech in Mechanical Engineering Engineering BTech in Chemical Engg. BTech in Computer (Major: Petrochemicals and Science & Engineering Polymers Engineering) 
Brochure_Btech_Admission 2025.pdf|17|Fourth-Year Study at Energy Institute, Bengaluru (EIB) In line with the Institute’s vision to provide students with enhanced academic exposure and stronger industry connect, Rajiv Gandhi Institute of 
Brochure_Btech_Admission 2025.pdf|18|After the completion of 6th semester, these students will pursue their final year of study at the Energy Institute, Bengaluru (EIB) a dedicated Centre of RGIPT located in Bengaluru, Karnataka, to bene
Brochure_Btech_Admission 2025.pdf|19|Bengaluru (EIB) has been operational since 2018, functioning as a Centre of RGIPT. Since October 2024, EIB has begun functioning from its permanent 150-acre campus at Kambalipura, Hosakote Taluk, Beng
Brochure_Btech_Admission 2025.pdf|20|Center, Post Office, Cafeteria, Stationery and Grocery Stores, Gymnasium, Health Center, Ambulance Facility, Meditation & Yoga Center, and bus service to shuttle between nearby cities. The institute a
Brochure_Btech_Admission 2025.pdf|21|activities of the Institute. Licensed software, email services and in-house software development for the institute’s needs are also managed by the CCIS. All the equipment has power backup (UPS)with pr
Brochure_Btech_Admission 2025.pdf|22|connectivity provides students access to online library resources such as Infraline, EBSCO, Emerald, American Chemical Society (ACS), IEEE, SEPM, One Petro, SEG, AAPG, MathSciNet, SciFinder etc. 3.3. 
Brochure_Btech_Admission 2025.pdf|23|possess State-of-the-Art research environment as both teaching and research are complementary. The Institution has established a Central Instrumentation facility (CIF), where high end sophisticated eq
Brochure_Btech_Admission 2025.pdf|24|through offering technical and consultancy services. These equipment facilities are available for UG students to pursue https://rgipt.ac.in/en/page/home-cif Design & Innovation Center project work. 3.
Brochure_Btech_Admission 2025.pdf|25|facilities collaboration with Algo8 to provide the students with the opportunity to pursue project work in the area of artificial intelligence and machine learning. The institute is in the process of 
Brochure_Btech_Admission 2025.pdf|26|not only to equip students with solid technical is to offer professional industrial experience up to knowledge but also to nurture a strong research 16 weeks to the students. The internship aims to te
Brochure_Btech_Admission 2025.pdf|27|Merit cum Means scholarship equivalent to 25% of their research in reputed international journals as the tuition fee starting from the first semester itself is first authors. offered to a selective nu
Brochure_Btech_Admission 2025.pdf|28|the needy and deserving students. Student’s welfare student authors, fair recognition is ensured 60% fund is subject to the policy of the institute. of the award goes to the first author, and the rema
Brochure_Btech_Admission 2025.pdf|29|To encourage UG students to explore research and domain specific and other industries for various innovation, the institute provides a URF scheme. training programs, workshops for the exposure Under t
Brochure_Btech_Admission 2025.pdf|30|action to improve the academic and administrative performance of the Institute. The aim is to promote measures for institutional functioning towards quality 6. F rom Classroom to Corporate: enhancemen
Brochure_Btech_Admission 2025.pdf|31|Research Award for Pioneering B.Tech. Innovators” are offered the unique opportunity to undertake an At RGIPT, we believe that undergraduate education industry internship during their 8th semester. go
Brochure_Btech_Admission 2025.pdf|32|its students. UG degree holders in engineering and leading companies in sectors such as Energy, technology are directly employed by a number of Oil & Gas, Electronics, IT, and Renewable reputed indust
Brochure_Btech_Admission 2025.pdf|33|TCS, Toshiba, Planet Spark, Indorama, Adani Gas, technologies used in the industry. HLS Asia, Pluralsight India, Sun Petro, etc.). The The internship is fully credited and evaluated as part graduates 
Brochure_Btech_Admission 2025.pdf|34|Engineering and Technology are the backbone of disciplines. Additionally, the departments such as the development of a society. Living, health, and Computer Science Engineering (CSE), Information econ
Brochure_Btech_Admission 2025.pdf|35|like Siemens, Johnson Matthey, Algo8, EIL,  Short Term/Summer Projects (with duration HAL, IOCL, HPCL, BPCL, ONGC, DGH, around less than three months) ExxonMobil, Halliburton, HLS Asia, Indorama,  E
Brochure_Btech_Admission 2025.pdf|36|curiosity and experimentation among students by 8. Co-Curricular Activities building a collaborative community for problem- solving and supporting both technical learning 8.1. Design and Innovation Ce
Brochure_Btech_Admission 2025.pdf|37|class technical institute, RGIPT puts adequate through seminars, webinars, and conferences, emphasis on encouraging technical creativity and to cultivate practical skills through hands-on among the st
Brochure_Btech_Admission 2025.pdf|38|The Council functions through five major guidance, infrastructure, monitoring, and some clubs: 1. Tinkering Club, 2. Kode Club, 3. Cell funding as well, to run the projects. (Entrepreneurship Cell), 4
Brochure_Btech_Admission 2025.pdf|39|provide the students with an opportunity to enrich their knowledge concerning a diverse range of domains, inculcating the sense of responsibility, and enhancing their potential. Student Chapter organi
Brochure_Btech_Admission 2025.pdf|40|coaches for students to engage in sporting facilities on campus. The institute boasts of various outdoor and indoor gaming facilities like badminton, basketball, volleyball, tennis, football, kho-kho,
Brochure_Btech_Admission 2025.pdf|41|a healthy physique. 9.2. Social Council The Social Service Council of RGIPT, stands as a beacon of purposeful engagement, committed to instilling the values of RESPECT—Responsibility, Empathy, Service
Brochure_Btech_Admission 2025.pdf|42|involvement under the GROW approach-Guide, Respect, Organize, and Work—nurturing leadership, collaborative spirit, and a deep commitment to social equity. Key Events and Initiatives (2024–25) Primary 
Brochure_Btech_Admission 2025.pdf|43|duty among students and faculty alike. Swachhata Pakhwada (March 2025): A month-long cleanliness and awareness drive in collaboration with Jais Nagar Palika. Activities 10 BTech Admission 2025 include
Brochure_Btech_Admission 2025.pdf|44|Club, Music Club, Dance Club, and Fine Arts for students from 6 nearby schools, this event Club. offered a platform to showcase innovations and introduced school students to RGIPT’s academic environme
Brochure_Btech_Admission 2025.pdf|45|of the association includes reconnecting alma The Cultural Council at RGIPT was established mater to their alumni, providing a vibrant forum for the students to explore their unique talents for intera
Brochure_Btech_Admission 2025.pdf|46|Being a residential Institution, it is compulsory for  RO water purifier and geyser facilities. all students to reside in the campus during their  Round the clock power back up facility. programs. R
Brochure_Btech_Admission 2025.pdf|47|the vibrancy of the hostel environment. Lawn Tennis, Football and Cricket.The mess serves The major facilities available in the hostel are: sumptuous veg and non-veg food to the students. It is superv
Brochure_Btech_Admission 2025.pdf|48|affairs is an essential component of the general strengthening administration and decision making. These gym facilities are maintained regularly and are accessible during fixed hours for all hostel 11
Brochure_Btech_Admission 2025.pdf|49|“From OPD to Emergency – RGIPT A. Boys’ Hostel Gym Facilities Ensures Your Health, Always!” Located in the hostel area, the Boys’ Gym is At RGIPT Jais, student welfare furnished with a wide range of m
Brochure_Btech_Admission 2025.pdf|50|Medical Reimbursement Policy designed to ensure  Free Weights: Chrome Dumbbells (38 sets accessible and affordable treatment. (For detailed ranging from 10–50 kg), Rubber Weight Plates policy guideli
Brochure_Btech_Admission 2025.pdf|51|Ground Floor)  Support for referrals to specialist doctors or hospitals when required. The Girls’ Gym is thoughtfully set up with key  Assistance with medical expenses during in-patient equipment to
Brochure_Btech_Admission 2025.pdf|52|supported by a responsive and student-friendly Benches, Zigzag Rod, Medicine Ball (4 kg) healthcare system.  Free Weights: Chrome Dumbbells (8 sets of 2–10 12 BTech Admission 2025 13. Anti-Ragging Po
Brochure_Btech_Admission 2025.pdf|53|Ragging in Higher Educational Institutions, 2009 students are offered professional counselling (as amended from time to time), RGIPT maintains a and support to help them navigate personal or Zero-Tole
Brochure_Btech_Admission 2025.pdf|54|the Hon’ble Supreme Court of India [Ref: UGC Regulations on Curbing the Menace of Ragging in Higher Educational Institutions, 2009, notified under 15. Safe Campus for Girls the UGC Act, 1956, vide No.
Brochure_Btech_Admission 2025.pdf|55|indecent, or harmful acts nearby organizations. The success rate of the  Cyberbullying or harassment via digital platforms female students is very high with almost all of Such activities are strictly
Brochure_Btech_Admission 2025.pdf|56| helpline@antiragging.in  www.antiragging.in Institutional Contact – RGIPT  Dean of Students’ Affairs  +91 535 270 4604 (Office) Note: All complaints will be handled with utmost confidentiality & 
Brochure_Btech_Admission 2025.pdf|57|1.1. Seat Matrix Table 1: The branch-wise distribution of seats for BTech programmes are as follows: OBC- Total UR EWS SC ST BTech Programmes NCL Girls* Seats (40.5%) (10%) (15%) (7.5%) (27%) Chemical
Brochure_Btech_Admission 2025.pdf|58|Mechanical Engineering 30 12 3 8 5 2 5 Petroleum Engineering 60 24 6 16 9 5 10 Total 530 212 53 140 83 42 85 Grand Total - 615 *Supernumerary Seats. 1.2. Application Fee The application fee is non-ref
Brochure_Btech_Admission 2025.pdf|59|Eligibility: 1. Candidate must have qualified in JEE (Advanced) 2025. 2. Must have secured ≥60% aggregate marks in Class XII* (≥55% for SC/ST/PwD categories). Round 2: Candidates Eligible for JEE (Adv
Brochure_Btech_Admission 2025.pdf|60|Preference Order:  First preference: JEE (Advanced) 2025 Rank  Second preference: JEE (Mains) Ranks 2025. *Subjects considered for aggregate in Class XII: Physics, Chemistry, Mathematics, Language, 
Brochure_Btech_Admission 2025.pdf|61|Reservation policy as per the Government of India directive will be followed. In addition, following the GOI directive and to encourage technical education among the girls, few seats# will be reserved
Brochure_Btech_Admission 2025.pdf|62|[2] N o Inter-Round Auto-Upgradation of rounds. Permitted: This means candidates applying in later rounds (e.g., Round 2 or Round 3) [3] Use of Withdrawn or Forfeited Seats After will not be eligible 
Brochure_Btech_Admission 2025.pdf|63|considered for upgradation or allocation of same round (for candidates who opted in). 15 BTech Admission 2025 DATE FOR ROUND #1 COUNSELLING Advisory note for JEE (Advanced) 2025 Qualified Candidates f
Brochure_Btech_Admission 2025.pdf|64|ONLINE APPLICATION START FOR 1ST ROUND: 2nd June 2025 (Monday) LAST DATE TO APPLY: 15th June 2025 (Sunday) Step Event Date Remarks/Note For Applicant 1. 1st Seat Allotment for Round#1 16th June 2025 1
Brochure_Btech_Admission 2025.pdf|65|vacant seats (if available). II. Seats forfeited due to non-payment of the blocking amount will be treated as withdrawn and will be allotted to eligible waitlisted candidates. 4. Last Date of Fee Paym
Brochure_Btech_Admission 2025.pdf|66|DATE FOR ROUND #2 COUNSELLING ONLINE APPLICATION START FOR 2ND ROUND: 27th June 2025 LAST DATE TO APPLY FOR 2ND ROUND: 13th July 2025 Step Event Date Remarks/Note For Applicant 1. 1st Seat Allotment f
Brochure_Btech_Admission 2025.pdf|67|I. C andidates who have paid the seat blocking amount will be considered for auto-upgradation against the vacant seats. II. Seats forfeited due to non-payment of the blocking amount will be treated as
Brochure_Btech_Admission 2025.pdf|68|Round-3 applicants to view. against vacant seats from Round 1 & 2. They will compete with new applicants for Round 3. Round #3 will be conducted if seats are still available after Round #1 & #2 2. Fee
Brochure_Btech_Admission 2025.pdf|69|Total 9,000.00 9,000.00 C. SEMESTER FEE PAYABLE FOR EACH SEMESTER (NON-REFUNDABLE) 1 Tuition Fee 1,00,000.00 75,000.00 2 Examination Fee 2,000.00 2,000.00 3 Registration/Enrollment Fee 1,000.00 1,000.
Brochure_Btech_Admission 2025.pdf|70|1. In addition, all students will pay a mess advance of `20,000.00* per semester at the beginning of each semester, which will be adjusted towards actual bills at the end of each academic year. 2. The
Brochure_Btech_Admission 2025.pdf|71|The refund policy for candidates allotted seats in the 1st round is outlined below. Candidates must strictly adhere to the specified withdrawal deadlines and procedures to be eligible for refunds. The
Brochure_Btech_Admission 2025.pdf|72|carefully to avoid any confusion or loss of fees. Withdrawal Case Refund Amount & Details Deadline CASE-I On or Before Rs. 28,500/- refund after deduction of Rs. 1,500/- processing (Only Seat Blocking
Brochure_Btech_Admission 2025.pdf|73|CASE-III On or After Only security deposit of Rs. 9,000/- will be refunded (Full Fees Paid, 8th August 2025 after deducting mess advance charges based on actual Withdrawal on or After (Physical Regist
Brochure_Btech_Admission 2025.pdf|74|the amount paid and the timing of withdrawal relative to physical registration. The Institute disclaims any responsibility for delays or failures to meet deadlines on the candidate’s part and will not
Brochure_Btech_Admission 2025.pdf|75|Withdrawal One Day (One day before the date SC/ST/PwD: Rs. 96,500/- (1,26,500 - 30,000) Before Registration) of Physical Registration) NOTE: Withdrawal requests must be emailed to btech_admission@rgip
Brochure_Btech_Admission 2025.pdf|76|an email to: btech_admission@rgipt.ac.in 2. Email Subject Line: Use the following subject line format exactly: Application No. - Refund Request (Replace “Application No.” with your actual application 
Brochure_Btech_Admission 2025.pdf|77|Refunds will be processed within 30 working days after approval of the blocking amount refund request. For those who paid the full fees, refunds will be issued within one month from the commencement o
Brochure_Btech_Admission 2025.pdf|78|identity card. Candidates from other than these states must provide an Aadhaar Number. The applicant shall follow the Step by Step instruction given below to complete the application procedure. Step-1
Brochure_Btech_Admission 2025.pdf|79|entered. Fill that OTP in the given section and click on [Proceed] button. 5. After clicking on Proceed button a Password will be generated and sent to your mobile number and email ID. Step-2 Procedur
Brochure_Btech_Admission 2025.pdf|80|reading the instructions carefully. 2. You will be redirected to the Fee Payment page. Pay the prescribed fees using Debit Card/Credit Card/ Net Banking/UPI. The stipulated application fee to be paid 
Brochure_Btech_Admission 2025.pdf|81|1. After successful Payment applicant will be redirected to Personal Information page. 2. Select choice of preference of disciplines. 3. Fill your details like Father’s Name, Mother’s Name, Caste Cert
Brochure_Btech_Admission 2025.pdf|82|Details page. 2. Fill your details like Alternate Mobile Number, Local Address, Email ID of Father/Guardian etc. 3. Click on Checkbox if your Permanent Address is same as Correspondence Address, else 
Brochure_Btech_Admission 2025.pdf|83|of College, Marks Obtained etc. 3. After filling and selecting all the details correctly click on Save & Continue button. 4. You will receive a Pop-Up Message of successful submission of details. Clic
Brochure_Btech_Admission 2025.pdf|84|1. After successful submission of JEE Details applicants will be redirected to the Bank Details Page. 2. Fill your details like Name of Account Holder,Name of Bank,Account Number, IFSC Code,PAN. 3. Af
Brochure_Btech_Admission 2025.pdf|85|exceed 100 KB each. 3. Click on Save & Continue button. Requests for branch preference changes will not be entertained after submission of Application Form Step-10 Preview and Final Submission of Appl
Brochure_Btech_Admission 2025.pdf|86|in case you are not sure for final submission of form else click on Yes, I Am Sure! button. 5. A pplicant can download the submitted application by clicking on Download Application Form button and can
Brochure_Btech_Admission 2025.pdf|87|the Admission Portal. 2. The candidates will be required to pay the fee for consideration of admission 3. The selected list of candidates for subsequent rounds shall be published based on the availabi
Brochure_Btech_Admission 2025.pdf|88|Email: btech_admission@rgipt.ac.in 6. How to Reach RGIPT Location: [Click Here] Major Route Maps to reach RGIPT From Lucknow Airport & Railway Station [Click Here] From Allahabad Airport & Railway Sta
Brochure_Btech_Admission 2025.pdf|89|Rajiv Gandhi Institute of Petroleum Technology (RGIPT) Bahadurpur, Jais, Amethi - 229304, Uttar Pradesh Phone: 0535 270 4565/4568/4595 Email: btech_admission@rgipt.ac.in