Brochure_Btech_Admission 2024.pdf|0|I B nformation rochure 2024 B. Tech. Admission Join RGIPT to build your career in Energy Domain . . . Rajiv Gandhi Institute of Petroleum Technology An Institution of National Importance, Government o
Brochure_Btech_Admission 2024.pdf|1|4.9. National and International Collaborations 11 5. Internal Quality Assurance Cell 11 6. Training & Placement 12 7. Co-Curricular Activities 12–13 7.1. Design and Innovation Centre 12 7.2. Incubatio
Brochure_Btech_Admission 2024.pdf|2|1.6. Table 2: Important Date(s) 18–19 1.7. Fees Details 19–21 1.7.1. Refund Policy 20–21 1.8. Application Process 21–23 2. Admission Office 23 3. How to Reach 23 B.Tech Admission 2024 PART A: General 
Brochure_Btech_Admission 2024.pdf|3|and Digitalization. For aspiring students, RGIPT offers a unique blend of academic rigor and practical experience facilitated by state-of-the-art facilities and an industry-aligned curriculum. Additio
Brochure_Btech_Admission 2024.pdf|4|programs in various areas of basic sciences, humanities, engineering and management are also offered by the Institute. These programs seek to develop human resources of the highest caliber to cater to
Brochure_Btech_Admission 2024.pdf|5|of engineering, whereas Technology education requires broad based fundamental knowledge of both science and engineering with analytical and innovative skills. Quality Engineering education should incu
Brochure_Btech_Admission 2024.pdf|6|pedagogy and curriculum of RGIPT is diverse. Thus, for catering to students with different capabilities (mental, emotional and physical), the educational programmes at RGIPT is flexible both in terms 
Brochure_Btech_Admission 2024.pdf|7|nature in the domain areas. The programs have strong ingredient of industrial need and inputs. Provision of pursuing last year of B. Tech. programme at Energy Institute Bengaluru exists for students o
Brochure_Btech_Admission 2024.pdf|8|Enhances problem solving, critical thinking and team building ability Design & Innovation Center Extended Internship Promotion of Innovation, Incubation To gain professional and Enterpreneurial indust
Brochure_Btech_Admission 2024.pdf|9|i .n c Teh ee. c ri hin n . gC inh e Cm omic pa ul ter P( oMB l. ya T mjoe erc : rh sP. e Ein t nr o gC c ih nhe eem em ri ic i nca gal )lE sn ag ng d. 5% 3% 7% 2% 10% 10% Science B E n.& T g eE incn 
Brochure_Btech_Admission 2024.pdf|10|CONTACTS Minor Programmes Head: Dr Milan Kumar  Computer Science & Engineering  Mathematics & Computing Mobile: +91-8948818821 Office: +91-535 270 4505  Information Technology  Energy Management D
Brochure_Btech_Admission 2024.pdf|11|Mobile: +91-9717621590 Office: +91-535 270 4626 03 Computer Science & Design Engg. B. Tech. Department of Computer Science and Engineering Duration: 04 Years Number of Seats: 50 CONTACTS Minor Program
Brochure_Btech_Admission 2024.pdf|12|CONTACTS Minor Programmes Head: Dr U D Dwivedi  Computer Science & Engineering  Mathematics & Computing Mobile: +91-7310150257 Office: +91-535 270 4526  Chemical Engineering  Energy Management DUG
Brochure_Btech_Admission 2024.pdf|13| Petroleum Engineering  Business Consulting DUGC: Dr Saurabh Pandey Mobile: +91-8811909756  Information Technology Office: +91-535 270 4729 6 Information Technology 06 B. Tech. Department of Comput
Brochure_Btech_Admission 2024.pdf|14|CONTACTS Minor Programmes Head: Dr Satish Kr. Sinha  Computer Science & Engineering  Energy Management Mobile: +91-9453045135  Information Technology  Petroleum Engineering Office: +91-535 270 454
Brochure_Btech_Admission 2024.pdf|15|Mobile: +91-8001824330  Electronics Engineering Office: +91-535 270 4673 09 Petroleum Engineering B. Tech. Department of Petroleum Engineering and Geo-Engineering Duration: 04 Years Number of Seats: 
Brochure_Btech_Admission 2024.pdf|16|Duration: 04 Years Number of Seats: 30 CONTACTS Minor Programmes Head: Dr Milan Kumar  Computer Science & Engineering  Mathematics & Computing Mobile: +91-8948818821 Office: +91-535 270 4505  Infor
Brochure_Btech_Admission 2024.pdf|17|DUGC: Dr Vivek Kumar  Electronics Engineering  Business Consulting Mobile: +91-8299181650 Office: +91-535 270 4528 Petroleum Engineering 12 (Major in Applied Petroleum Geoscience) B.Tech. Department
Brochure_Btech_Admission 2024.pdf|18|B.Tech & M.Tech Duration: 05 Years Number of Seats: 40 CONTACTS Minor Programmes Head: Dr Susham Biswas  Petroleum Engineering  Energy Management Mobile: +91-9919556965 Office: +91-535 270 4626  Ch
Brochure_Btech_Admission 2024.pdf|19|technology, power sector, design, refrigeration, air conditioning sector and aerospace. It is expanding beyond its boundaries and has become more interdisciplinary in nature. The job prospects on offe
Brochure_Btech_Admission 2024.pdf|20|3.1.2 IDD (B. Tech. in Petroleum Engineering and MS in Petroleum and Natural Gas Engineering) RGIPT is going to start an international ‘3+1+1 BTech/MS degree’ in association with the Petroleum and Nat
Brochure_Btech_Admission 2024.pdf|21|and subsequently they will have an opportunity of continuing over (after making due application) for a one-year Masters degree at Pennsylvania State University. The MS degree will be awarded by Pennsy
Brochure_Btech_Admission 2024.pdf|22|Stationery and Grocery Stores, Gymnasium, Health Centre, Ambulance Facility, Meditation & Yoga Centre, and bus service to shuttle between nearby cities. The institute is also having high performance c
Brochure_Btech_Admission 2024.pdf|23|academic and research activities of the Institute. Licensed software, email services and in house software development for the Institute needs are also managed by the CCIS. All the equipments have pow
Brochure_Btech_Admission 2024.pdf|24|online library resources such as Infraline, EBSCO, Emerald, American Chemical Society (ACS), IEEE, SEPM, One Petro, SEG, AAPG, MathSciNet, SciFinder etc. 9 B.Tech Admission 2024 4.3. Laboratories 4.3.
Brochure_Btech_Admission 2024.pdf|25|World-class teaching Institutions across the globe essentially possess State-of-the-Art research environment as both teaching and research are both complementary. The Institution has established a Cen
Brochure_Btech_Admission 2024.pdf|26|facilities areas of Energy and Petroleum at RGIPT & its centers and also help nearby academic & R&D organizations and industries through offering technical and consultancy services. These equipment fa
Brochure_Btech_Admission 2024.pdf|27|For example, recently the institute has entered into collaboration with Algo8 to provide the students with the opportunity to pursue project work in the area of artificial intelligence and machine lea
Brochure_Btech_Admission 2024.pdf|28|to 16 weeks to the students. The internship aims to familiarize students to the actual process o production and manufacturing associated with Industries. The exposure provides the students with indust
Brochure_Btech_Admission 2024.pdf|29|is subjected to the policy of the institute. 4.9. National and International Collaborations a) A cademic: MOUs have been signed with national and international institutions of repute for carrying out 
Brochure_Btech_Admission 2024.pdf|30|for institutional functioning towards quality enhancement through internalization of quality cultures and institutionalization of best practices. 11 B.Tech Admission 2024 6. Training & Placement Engin
Brochure_Btech_Admission 2024.pdf|31|students, the training and placement cell of RGIPT offers summer internship opportunities to its students. UG degree holders in engineering and technology are directly employed by a number of reputed 
Brochure_Btech_Admission 2024.pdf|32|preferred for placement in the Oil and Energy sector industries. Like the previous years, most of the leading companies and PSUs in the domain areas of Petroleum & Energy visited RGIPT for campus recr
Brochure_Btech_Admission 2024.pdf|33|Microsoft, Intel, Qualcomm, Apple, Sony, Oracle, Amazon, Cisco Systems (India) Pvt Ltd, J.P. Morgan Chase, Samsung India Electronics Pvt Ltd, Taiwan Semiconductor Manufacturing Company (TSMC), Global 
Brochure_Btech_Admission 2024.pdf|34|elevate to a level of a world class technical institute, RGIPT puts adequate emphasis on encouraging technical creativity among the students and faculty members. Design and Innovation Center (DIC) is 
Brochure_Btech_Admission 2024.pdf|35|around less than three months)  Extended Projects/B. Tech. Projects: More than three months 12 B.Tech Admission 2024 7.2. Incubation Center (IC) RGIPT aims to incubate research innovative ideas throu
Brochure_Btech_Admission 2024.pdf|36|RGIPT IC’s incubatees would primarily focus on the improving living standards of the people of our country. The incubation centre will also provide support for the commercialization aspect of products
Brochure_Btech_Admission 2024.pdf|37|to inculcate in the students of RGIPT, a culture of innovation and a desire to succeed. The committee has in the past year, organized a fest Winter School - Bridging the Skill Gap where project made b
Brochure_Btech_Admission 2024.pdf|38|entrepreneurial spirit and propose innovative solutions for niche problems. 7.4. Student Chapters There are many active student chapters at RGIPT such as IICHE, SPE, FIPI, AAPG, AICHE, SEG, and Geek f
Brochure_Btech_Admission 2024.pdf|39|potential. Student Chapter organizes seminars, guest lectures, analytical quizzes, placement talks, and intern talks among many other events enabling the attendees to have an overall growth while enri
Brochure_Btech_Admission 2024.pdf|40|like badminton, basketball, volleyball, tennis, football, kho- kho, cricket, chess, table tennis, snooker, and carrom. The annual event of the Institute, Energia, draws the best teams from different c
Brochure_Btech_Admission 2024.pdf|41|initiated the Gyan Arpan Teaching Centre to teach the school children of the nearby villages. The teaching centre also prepares students for admission in Navodaya Vidyalaya, the prestigious government
Brochure_Btech_Admission 2024.pdf|42|The Cultural Council at RGIPT was established for the students to explore their unique talents and skills. The Council encourages students to represent the Institute at various fests and events. The C
Brochure_Btech_Admission 2024.pdf|43|Alumni Association by the name of “Rajiv Gandhi Institute of Petroleum Technology Alumni Association” has been formed at the institute with the purpose to foster the ties between alumni, the community
Brochure_Btech_Admission 2024.pdf|44|programs. RGIPT provides separate hostel facilities for boys and girls. The hostel is under round the clock surveillance for the safety of students. The hostels are managed by the team of Council of W
Brochure_Btech_Admission 2024.pdf|45| Round the clock Wi-Fi and LAN internet connectivity.  Indoor games like Badminton, Billiards, Table Tennis etc.  Outdoor games such as Basketball, Volleyball, Lawn Tennis, Football and Cricket. Th
Brochure_Btech_Admission 2024.pdf|46|administration and decision making. 15 B.Tech Admission 2024 10. Health facilities The Health Centre at the institute is equipped with basic health care facilities to handle the minor illness and prov
Brochure_Btech_Admission 2024.pdf|47|Hospital, Amethi, AIIMS, Raebareli, etc. Advisory: Students are advised to have Mediclaim policy before joining the campus. 11. Safe Campus for Girls RGIPT is deeply committed towards providing a safe
Brochure_Btech_Admission 2024.pdf|48|provided with dedicated hostel facilities and a safe & secure environment. 16 B.Tech Admission 2024 PART-B: Admission 1. Admission Admission in 2024 for 4-year B. Tech. and 5-year Integrated Dual Degr
Brochure_Btech_Admission 2024.pdf|49|50 20 5 13 8 4 8 E-Vehicle Technology) B. Tech. in Information Technology 50 20 5 13 8 4 9 B. Tech. in Mathematics and Computing 60 24 6 16 9 5 12 B. Tech. in Petroleum Engineering 60 24 6 16 9 5 9 B.
Brochure_Btech_Admission 2024.pdf|50|Intelligence IDD - B Tech in Petroleum Engineering and MS in Petroleum and Natural Gas 10 3 1 3 2 1 2 Engineering** Total 600 239 60 160 94 47 106 *Supernumerary Seats. $This is a 5-year dual degree p
Brochure_Btech_Admission 2024.pdf|51| Admission will be based on JEE (Advanced) or JEE (Mains)$ with 80% aggregate (75% for SC/ST/ PwD) in Class 12.  During preparation of merit list preference will be given to JEE (Advanced) qualified
Brochure_Btech_Admission 2024.pdf|52|or equivalent board examinations. 10% supernumerary seats of the total sanctioned strength are allotted for foreign students. International students may also apply through ‘Study in India’ website. Fo
Brochure_Btech_Admission 2024.pdf|53|Reservation policy as per the Government of India directive will be followed. In addition, following the GOI directive and to encourage technical education among the girls, few seats# will be reserved
Brochure_Btech_Admission 2024.pdf|54|Last date for seat blocking by paying Rs. 30 000 12th July, 2024 (Friday) Last date for payment of balance/remaining fee for 16th July, 2024 (Tuesday) 1st round as per Table 3 2nd Round of Admission L
Brochure_Btech_Admission 2024.pdf|55|Online Classes 14th August, 2024 to 12th Sept., 2024 Reporting at Campus 13th September, 2024 (Friday) Physical Registration in the Department 14th September, 2024 (Morning) Institute Level Orientatio
Brochure_Btech_Admission 2024.pdf|56|qualified students while preparation of merit list, however if seats remain vacant then those vacant seats will be filled by JEE Mains qualified students in each round. 1.7. Fees Details The admission
Brochure_Btech_Admission 2024.pdf|57|SC/ST/ Rs. 96 500/- (B. Tech) Rs. Rs. Rs. 30 000/- PwD Rs. 97 500/- (IDD) 126 500/- 127 500/- B. Tech. IDD Rs. Rs. Fee to be deposited Gen/OBC/EWS 136 500/- 136 500/- for other semesters Rs. Rs. SC/ST
Brochure_Btech_Admission 2024.pdf|58|costs-aid/tuition/. For other details please visit www.rgipt.ac.in. 19 B.Tech Admission 2024 Fees for Foreign Students 4-Year B. Tech. (For SAARC Countries) (For other Countries) a) At the time of Adm
Brochure_Btech_Admission 2024.pdf|59|ICICI Bank, State Bank of India and Union Bank of Indian for prospective students of RGIPT. The education loan will be sanctioned at RGIPT only on the day of admission. Mess Charges may also be includ
Brochure_Btech_Admission 2024.pdf|60|Withdrawal before the last date of the round in which admission was offered B. Tech./ IDD: B. Tech./ IDD: (1) Last Date of seat Withdrawal of 1st Round: 16th July 2024; Rs. 28,500/-* Rs. 28,500/-* (2)
Brochure_Btech_Admission 2024.pdf|61|deduction of Rs. 30,000.00. Table 4.2: Amount to be refunded before the last date of the registration Amount to be refunded Withdrawal Dates GEN/OBC/EWS SC/ST/PwD B. Tech: Rs. 121,500 /-** B. Tech: Rs
Brochure_Btech_Admission 2024.pdf|62|whatsoever reason on of after 11th August 2024. In this case, only the security deposit/caution money of Rs. 9000 shall be refunded. Note: The institute is not responsible for any delay from your side
Brochure_Btech_Admission 2024.pdf|63|Note: The refund process for all three cases will take time of 8 to 10 weeks after the commencement of classes. CASE – IV: Candiates taking withdrawal after admission offered In 3rd round If any candi
Brochure_Btech_Admission 2024.pdf|64|in the Table 2. It may be noted that candidates from Assam, Meghalaya, Jammu & Kashmir are exempted from entering Aadhar Number in the application form. However, during admission they have to produce 
Brochure_Btech_Admission 2024.pdf|65|3. Fill all the details carefully Name of Applicant, Date of Birth, Category, Mobile Number and Email ID. After filling all the details click on [Register] button. 4. Your Registration Number will dis
Brochure_Btech_Admission 2024.pdf|66|2. After Login you will be redirected to Instructions section. Read the instructions carefully before filling the form. 3. I n case you forgot your password then click on Forgot Password button and do
Brochure_Btech_Admission 2024.pdf|67|3. Select your Payment Mode and click on Proceed to Pay Online button. 4. You will be redirected to Payment Gateway through which you will have to submit the fees. 5. After successful payment you will
Brochure_Btech_Admission 2024.pdf|68|4. After filling all the details correctly click on Save & Continue button. 5. Y ou will receive a Pop-up Message of successful submission of details. Click on OK button to proceed. 6. Fields marked w
Brochure_Btech_Admission 2024.pdf|69|5. You will receive a Pop-Up Message of successful submission of Address & Contact Details. Click on OK button to proceed further. Step-6 Procedure to Fill Academic Qualification Details 1. After succ
Brochure_Btech_Admission 2024.pdf|70|1. After successful submission of Academic Qualification Details applicant will be redirected to Other Qualification Page. 2. Fill your JEE(Advanced)/JEE (Mains) details 3. After filling all the detai
Brochure_Btech_Admission 2024.pdf|71|4. You will receive a Pop-Up Message of successful submission of details. Click on OK button to proceed further. Step-9 Procedure to Upload Documents 1. A fter successful submission of Bank Details ap
Brochure_Btech_Admission 2024.pdf|72|form and make required changes. 3. A fter final review of the application, click on Check Box of declaration and then click on Submit button. 4. You will receive a Pop-Up message regarding Final Submi
Brochure_Btech_Admission 2024.pdf|73|required changes, if any, while reviewing the application. Step-11 Selection and Admission Offer 1. A selection list of the shortlisted candidates will be prepared and published on the Institute Websi
Brochure_Btech_Admission 2024.pdf|74|Bahadurpur, Jais, Amethi, U.P.-229304 Phone (Landline): 0535 270 4565/ 68/ 95 Timing: 9:00 AM - 6:00 PM (On all working days- Monday to Friday) Email: btech_admission@rgipt.ac.in Mobile No.: +91-91516
Brochure_Btech_Admission 2024.pdf|75|► About Academics [Link] ► About Placement [Link] ► About Research Activities [Link] ► About Faculty Members [Link] Contact: The UG Admission Office Third Floor, Administrative Block, Rajiv Gandhi Ins