index--f6b0f8a00c.txt|0|âDaughters are considered as Lakshmi in our culture. Canât we facilitate daughters in our society by holding public programmes? There are several daughters, daughters-in-law who are doing exceptional 
index--f6b0f8a00c.txt|1|Shri Narendra Modi Honâble Prime Minister, India About RGIPT, Jais Rajiv Gandhi Institute of Petroleum Technology (RGIPT), Jais, is an autonomous institution established by the Government of India. Th
index--f6b0f8a00c.txt|2|Institute's prime objective is to provide world-class education, training, and research to roll out competent human resources to meet the growing requirements of the Petroleum & Energy sector. The asp
index--f6b0f8a00c.txt|3|To supplement its on-campus academic offerings, the RGIPT has established two centers at Sivasagar, Assam, and Bengaluru, Karnataka. Assam Energy Institute, the center of RGIPT at Sivasagar, Assam, is
index--f6b0f8a00c.txt|4|The âUrja Shaktiâ event is an initiative by RGIPT to promote female presence in the Energy Sector. It is started in 2021 and now this year we are celebrating the third edition of Urja Shakti. The name
index--f6b0f8a00c.txt|5|presented in the forum can serve as an effective tool to facilitate women empowerment in the energy sector. In order to promote gender equality in the energy sector, events like this will help female 
index--f6b0f8a00c.txt|6|The event is a national-level write-up competition for female undergraduate engineering and postgraduate engineering students in two separate categories. The winners of the event will be rewarded with
index--f6b0f8a00c.txt|7|It is an opportunity for participants to share their novel and innovative ideas in front of experts in the field. Urja Shakti is also taking this opportunity to honour a leading woman working in the E
index--f6b0f8a00c.txt|8|Important Instructions - The write up should not exceed 1500 words (A4-size with 2.5 cm margin on all sides, single column, Times New Roman font for English & font size 12, 1.5 line spacing written in
index--f6b0f8a00c.txt|9|Submission Details Online Submission Starts: 01st February, 2025 Last Date of Write-up Submission: 15th March, 2025 Where to submit the concept note and/or idea: The write-up of concept notes and/or i
index--f6b0f8a00c.txt|10|- An Expert Panel constituted by RGIPT, will evaluate the submitted write-ups. Award Ceremony The winners of the contest will be awarded on a physical award ceremony. The date of award ceremony will b
index--f6b0f8a00c.txt|11|PG Category - 1st Prize: Rs. 40,000/- - 2nd Prize: Rs. 30,000/- - 3rd Prize: Rs. 20,000/- - Consolation Prizes: Rs. 5,000/- Along with Cash prize, 1st, 2nd and 3rd winner in UG category will also get 
index--f6b0f8a00c.txt|12|Ao AI, ML, IoT application in Petroleum industry/ Cyber Security in Energy Sector/Automation in Energy Sector: - Mrs. Farha Naaz, Software Development Manager at Amazon - Dr.Virivinti Nagajyoti, Assis
index--f6b0f8a00c.txt|13|- Dr. Ramesh Senior Officer HPCL - Dr. Subhrajyoti Bhattacharyya, Deputy Manager, Oilmax Energy Pvt Ltd. - Dr. Tulika Bhattacharyya, Senior Scientist, Aditya Birla Science & Technology Company Pvt. Lt
index--f6b0f8a00c.txt|14|- Prof. Vikram Vishal- CMD, UrjanovaC Pvt. Ltd. Mumbai - Dr. Sireesha Aluri, Senior Research Engineer, Linde, Buffalo USA - Dr R K Kotnala, Chairman NABL Waste to Energy/ Zero waste energy: - Dr. Akar
index--f6b0f8a00c.txt|15|Energy Policies & Climate Changes: - Mr. Bragadesh Damodaran, Vice President, Capgemini - Mr. Arun Kumar Singhal, Founder & Chief Editor, DEW Journal - Mr. Manish Kumar, Manager, HPCL