phd-dec-2025--e1831e9f44.txt|0|PhD Admission Notice 2025 (for December 2025 session) Important Dates Date of written test and/or interview
phd-dec-2025--e1831e9f44.txt|1|Rajiv Gandhi Institute of Petroleum Technology (RGIPT), Jais is an autonomous institution established by the Government of India. The Institute has been accorded the status of “An Institution of Natio
phd-dec-2025--e1831e9f44.txt|2|& energy sector. The aspiration is to develop India as a global manpower hub for the entire petroleum and energy sector.
phd-dec-2025--e1831e9f44.txt|3|The PG programmes of the Rajiv Gandhi Institute of Petroleum Technology are aimed at developing manpower with sound theoretical and experimental background in frontier areas of research in engineering
phd-dec-2025--e1831e9f44.txt|4|seek to develop manpower of the highest quality to cater the needs of industry, R & D organizations and educational institutions.
phd-dec-2025--e1831e9f44.txt|5|The Institute at Jais has Department of Chemical & Biochemical Engineering, Department of Computer Science & Engineering, Department of Electrical and Electronics Engineering, Department of Management
phd-dec-2025--e1831e9f44.txt|6|Duly filled-in on-line applications on the prescribed form are invited for admission to PhD programmes for the Even Semester of Academic Session 2025-2026 in various departments/disciplines as given i
phd-dec-2025--e1831e9f44.txt|7|degree examination with the minimum marks/grades required for eligibility by the last date for document submission as mentioned in the academic calendar (within 08 weeks from the date of registration)
phd-dec-2025--e1831e9f44.txt|8|All forms mentioned in this document are available on the admission portal. Please use the links provided in the instructions given therein. 1. PhD Programmes A candidate may apply for any of the four
phd-dec-2025--e1831e9f44.txt|9|- Part-Time Registration Category 1.A Full Time Regular Registration Category Applicants must have the requisite qualification with minimum marks/CPI as mentioned below in the department/discipline co
phd-dec-2025--e1831e9f44.txt|10|1.A.1 Minimum Qualification: Ph D in Engineering - Applicants with Master’s degree in engineering in the discipline concerned or in an allied discipline/area must have a minimum of 60% marks or 6.0 CP
phd-dec-2025--e1831e9f44.txt|11|- A minimum of 65% marks or 6.5 CPI (on a 10.0 point scale) at the Master’s degree level PhD in Sciences - Applicants with Master’s degree in science in the discipline concerned or in an allied discip
phd-dec-2025--e1831e9f44.txt|12|- Applicants with Master’s degree in humanities/sciences or allied subjects with a minimum CPI of 6.00 on a 10.0 point scale (or 60% marks) in the qualifying degree. - Applicants with Bachelor’s degre
phd-dec-2025--e1831e9f44.txt|13|- Applicants with Bachelor’s degree in engineering discipline or in an allied discipline/area must have a minimum of 75% marks or 7.5 CPI (on a 10.0 point scale) at the Bachelor’s degree level. 1.A.1.
phd-dec-2025--e1831e9f44.txt|14|The students will receive the following monthly fellowship; - Junior Research Fellow (JRF): Rs. 37000/- - Senior Research Fellow (SRF): Rs. 42000/- The NET-LS qualified students may be eligible for In
phd-dec-2025--e1831e9f44.txt|15|For the Odd Semester of Academic Session 2025-26, the Institute Assistantship available in each department are as given in Table 2E of Annexure-II. No student shall be admitted to Full Time Regular Re
phd-dec-2025--e1831e9f44.txt|16|1.A.3 ICRGI PhD Research Fellowship: Two students from Full time regular registration category will be selected following an evaluation procedure to pursue their research work under joint supervision 
phd-dec-2025--e1831e9f44.txt|17|1.A.4 HPRGI Ph D Research Fellowship Two students from Full time regular registration category will be selected following an evaluation procedure to pursue their research work under joint supervision 
phd-dec-2025--e1831e9f44.txt|18|1.A.5 CPRGI PhD Research Fellowship Two students from Full time regular registration category will be selected following an evaluation procedure to pursue their research work under joint supervision o
phd-dec-2025--e1831e9f44.txt|19|1.A.6 BPRGI PhD Research Fellowship Three students from Full time regular registration category will be selected following an evaluation procedure to pursue their research work under joint supervision
phd-dec-2025--e1831e9f44.txt|20|1.A.7 Admission of Candidates having National-Level Scholarships There is a provision for admission to Ph.D. programmes for candidates who fulfill the eligibility criteria for the respective programme
phd-dec-2025--e1831e9f44.txt|21|Applicants must have requisite qualification with minimum marks/CPI (see Sec. 1.A.1). Such candidates may be offered admission after an interview as and when they apply in Departments, where they are 
phd-dec-2025--e1831e9f44.txt|22|1.B. Full Time External Registration category A candidate working in an external R&D organization or in an industry recognized by the Institute, which is equipped with necessary research and library f
phd-dec-2025--e1831e9f44.txt|23|The employer must undertake to pay a full salary to the candidate and relieve him/her from the duty to enable the candidate to stay on the campus and to complete the course work requirements. This is 
phd-dec-2025--e1831e9f44.txt|24|[N.B. Letter of appointment and Form – 16 for two years of service is required from the employer at the time of interview.] In case of a candidate, who is in professional service in a reputed organiza
phd-dec-2025--e1831e9f44.txt|25|In addition, an R&D organization/industry or a research area in the specific organization may be recognized by the Institute as per the following procedure. On the recommendation of the DPGC, the SPGC
phd-dec-2025--e1831e9f44.txt|26|1.C. Full Time Sponsored Registration Category A candidate who is sponsored by a Teaching Institution or by an R&D organization or by an Industry can also apply for admission to PhD programmes, provid
phd-dec-2025--e1831e9f44.txt|27|[N.B. Letter of appointment and Form – 16 issued by the employer for two years of service is required at the time of written test / interview. In addition, the candidate must submit an undertaking tha
phd-dec-2025--e1831e9f44.txt|28|1.D. Part-Time Registration Category The Institute offers Part-Time PhD programmes for permanent staff and faculty members of the Institute as well as Research Assistants/JRFs/SRFs working in an exter
phd-dec-2025--e1831e9f44.txt|29|The candidates working in externally funded projects need to have at least two years of remaining valid project period for consideration in this category. The PhD enrolled candidate after working in a
phd-dec-2025--e1831e9f44.txt|30|The Institute offers Part Time Ph.D. Programme also to a professionally employed person, who pursues the programme while continuing the duties of his/her service provided the sponsoring institution/or
phd-dec-2025--e1831e9f44.txt|31|[N.B.: Letter of appointment and Form 16 issued by the employer for two years of service is required at the time of written test/interview. In addition, the candidate must submit an undertaking that h
phd-dec-2025--e1831e9f44.txt|32|2. SELECTION CRITERIA Admission to PhD Programme - Admission will be based on written test and interview of the candidates shortlisted by the department concerned. - The following category of applican
phd-dec-2025--e1831e9f44.txt|33|- There will not be any category-wise or specialization-wise seats for selection under the above type; - The number of seats in this type will be 20% of the “announced number of seats” and shall be co
phd-dec-2025--e1831e9f44.txt|34|- Further, if qualifying marks are specified in written test and/or interview a 5% relaxation will be given to SC/ST candidate. If a candidate avails such relaxation, he/she shall not be considered fo
phd-dec-2025--e1831e9f44.txt|35|2.A. Reservations to SC/ST/OBC/EWS Candidates: In each discipline, 15% seats are reserved for SC, 7.5% seats for ST, 27% seats for OBC (non creamy layer) and 10% seats for EWS candidates. SC/ST/OBC ca
phd-dec-2025--e1831e9f44.txt|36|The SC/ST/OBC/EWS certificates must be produced at the time of written test / interview on the prescribed form. In case of OBC (non-creamy layer) the certificate should not be dated prior to six month
phd-dec-2025--e1831e9f44.txt|37|- Revenue Officer not below the rank of Tehsildar. - Sub-Divisional Officer of the area where the candidate and/or his family normally resides. - Administrator/ Secretary to the Administrator/ Develop
phd-dec-2025--e1831e9f44.txt|38|2.B. Reservations to Physically Challenged (PC) Candidates In total, 5% reservation (horizontal) shall apply for candidates with physical disability as per Govt. of India norms (minimum 40% disability
phd-dec-2025--e1831e9f44.txt|39|3. ADMISSION OF FOREIGN NATIONALS AND INDIAN NATIONALS RESIDING ABROAD Admissions to PhD Programmes are available for Indian Nationals Residing Abroad (INRA) and foreign nationals as per details given
phd-dec-2025--e1831e9f44.txt|40|- The applications of foreign nationals, who are sponsored by the Indian Council of Cultural Relations (ICCR)/Study in India programme, will be scrutinized by the departments concerned to assess their
phd-dec-2025--e1831e9f44.txt|41|Note: - Mere fulfillment of eligibility criteria does not guarantee admission in a programme. The candidates’ performance in the written test and interview should be at the levels expected for the res
phd-dec-2025--e1831e9f44.txt|42|4. Fee Structure for PhD Programme Fee Structure [click here] 4.A. Refund Policy table width="100%">Withdrawal of admission after deposition of full semester fees one day before the date of Physical R
phd-dec-2025--e1831e9f44.txt|43|- Chemical Engineering - Biochemical Engineering - Materials Science and Engineering - Metallurgical Engineering - Petroleum Engineering - Chemical Technology - Mechanical Engineering - Environmental 
phd-dec-2025--e1831e9f44.txt|44|- Electronics Engineering - Electrical Engineering - Petroleum Engineering - Energy Engineering, or equivalent Or Master's Degree in Science in the following Disciplines: - Computer Science - Computer
phd-dec-2025--e1831e9f44.txt|45|- Materials Science, or equivalent Master’s degree in Management/Engineering/ Technology or equivalent. Or Master’s degree in Science/Commerce/Arts or equivalent. Or Bachelor's degree in Engineering/T
phd-dec-2025--e1831e9f44.txt|46|Bachelor’s or Master’s Degree in Engineering/Technology in the following Disciplines: - Petroleum Engineering - Chemical Engineering - Mechanical Engineering - Electrical Engineering - Computer Scienc
phd-dec-2025--e1831e9f44.txt|47|- Petroleum Engineering - Chemical Engineering - Mechanical Engineering - Materials Science & Engineering - Electrical Engineering or equivalent Or Master’s Degree in Arts in Social Sciences and Human
phd-dec-2025--e1831e9f44.txt|48|Security and Privacy in IoV Networks: Blockchain, Cyber Security, Post Quantum Cryptography. Real-Time Scheduling System: Computational Geometry, Resource Scheduling in Cloud and Fog Computing Systems
phd-dec-2025--e1831e9f44.txt|49|Machine Learning and Artificial Intelligence: AI and ML applications, Multi-Sensor Data Analysis, AI for Deepfake Detection, Generative ML, AI in Reservoir Characterization, Computer Vision, Natural L
phd-dec-2025--e1831e9f44.txt|50|Electrical and Electronics Engineering Microelectronics/VLSI: Nano and Optoelectronics Devices, Solar Cells, Photodetectors, Organic FETs, Flexible Electronics, Wearable Electronics, Green Electronics
phd-dec-2025--e1831e9f44.txt|51|Power and Control: Power Electronics & Drives, Electric Vehicle, Machine learning applications to the power system and drives, Distributed generation, Power System, Microgrid and smart grid technologi
phd-dec-2025--e1831e9f44.txt|52|OB & HR: Human Resource Management, Indigenous Management Systems, Organizational Behaviour, Leadership, Corporate Ethics, Governance and CSR, Negotiations and Conflict Management. Business Analytics 
phd-dec-2025--e1831e9f44.txt|53|Operations: Operations Management, Supply Chain Management, Production System, Service Process Simulation and Service Level, Revenue Management and Analytics, Contracts Modelling, Capacity Sensitive P
phd-dec-2025--e1831e9f44.txt|54|Reliability theory, Statistical Information theory, Stochastic ordering and ageing, Order statistics and Record values. Numerical analysis of partial differential equations, Control theory, Hyperbolic
phd-dec-2025--e1831e9f44.txt|55|Isotope geochemistry, organic petrography, Hydrology and Watershed processes, Paleo environments and the sedimentary record, Inorganic/ Organic, Coal petrology, Structural geology, Engineering geology
phd-dec-2025--e1831e9f44.txt|56|Physics: Condensed Matter Physics and Materials Science, Magnetic and Multiferroic Materials, Soft Sensors and Actuators, Phase-Change Materials, Energy Storage Materials. Humanities and Social Scienc
phd-dec-2025--e1831e9f44.txt|57|Table 1C: Discipline-wise Research Areas for PhD Programmes The discipline-wise Research Areas in the Ph.D. programmes offered at RGIPT, Bengaluru for the Session 2025-26 are listed below. Table 1D: D
phd-dec-2025--e1831e9f44.txt|58|- Energy Nanomaterials, Spectro-microscopy and Biomass Valorization - Flow Assurance and Transport of Problematic Crude Oils; CO2 Utilization in EOR and Sequestration in Reservoirs; Drilling and Produ
phd-dec-2025--e1831e9f44.txt|59|- Traffic Prediction, Rumor Verification/Fake News Detection, Crisis Informatics and Explainable AI - Spatial Analytics, LiDAR and UAV Analytics, GIS, Satellite Image Processing, AR/VR based Digital T
phd-dec-2025--e1831e9f44.txt|60|- Energy Storage System Modelling and Control Design for Electric Vehicle Applications, Prescribed Performance Based Concurrent Identification and Control Design for Multiport Power Converters for Ren
phd-dec-2025--e1831e9f44.txt|61|- Corporate Sustainability Disclosure and Firm Performance: A Sectoral Analysis of Indian Energy Firms - Sustainable Portfolio Optimization: A Hybrid Machine Learning and Behavioral Finance Approach -
phd-dec-2025--e1831e9f44.txt|62|- RF and Microwave Engineering - Electrochemical Devices for Green Hydrogen Generation/Energy Storage - Artificial Intelligence and Deep Learning - Statistical Machine Learning - Energy Technology, Na
phd-dec-2025--e1831e9f44.txt|63|- Nanotechnology in Oil and Gas Industry, Drilling Fluids, Fracturing Fluids, EOR, Rheology of Complex Fluids, Microfluidics and CFD - Computational Soft Matter Physics, Classical Density Functional T
phd-dec-2025--e1831e9f44.txt|64|- Fire Dynamics, Modeling and Simulation of Fire, Combustion and Explosion Analysis in Storage Vessels and Pipelines, Process Safety and Risk Assessment, Industrial Fir Safety and Hazard Mitigation, I
phd-dec-2025--e1831e9f44.txt|65|- The PhD students registered at EIB and AEI centres will be awarded PhD degree by RGIPT. If required, they may complete their course work there or may complete course work at RGIPT, Jais. - The requi
phd-dec-2025--e1831e9f44.txt|66|- The PhD candidates in Part Time Category with B. Tech. degree and CPI of ≥ 7.5 in the qualifying examination and minimum 10 years of professional experience in relevant Industries. - The PhD candida
phd-dec-2025--e1831e9f44.txt|67|- Bharat Heavy Electricals Limited (BHEL), Research and Development Laboratories. - Central Mine Planning and Design Institute Limited, Ranchi. - Central Power Research Institute, Bangalore. - Central
phd-dec-2025--e1831e9f44.txt|68|- National Metallurgical Laboratory Extension Centre, Chennai. - Nothern Coalfields Limited, Singrauli - Coal India Limited - Geological Survey of India. - Jubilant Ingrevia, Uttar Pradesh