Profile (7).pdf|0|Contact Tejas Prakash tp5063144@gmail.com Java FullStackDev☕| Qualified JEE Advance’23| Mastering DSA 50 www.linkedin.com/in/tejas-acharya Patterns l AI & Technical Product Management | Product Design
Profile (7).pdf|1|English (Professional Working) Hindi (Professional Working) Along with software development, I have hands-on experience in Kannada (Native or Bilingual) product design, product management, and marketi
Profile (7).pdf|2|translating ideas into reliable, user-centric solutions. I take ownership Top Technical Product Management Fellowship from concept to deployment and enjoy building products that make a difference. Tec
Profile (7).pdf|3|August 2024 - Present (1 year 4 months) Bengaluru, Karnataka, India Backend Development (CourseView: 110+ hours) Proficient in Advance Java, Spring, Spring Boot, AWS, Microservices, REST APIs, Hiberna
Profile (7).pdf|4|Frontend Development (50+ hours) Mastered HTML, CSS, JavaScript, TypeScript, React, Redux, Tailwind CSS, and Bootstrap. Completed 10+ projects, including 2 major projects: Amazon Clone and Myntra Clon
Profile (7).pdf|5|healthtech, e-commerce, quick-commerce. Key highlights include: Wireframing & Prototyping: Designed both low- and high-fidelity wireframes, with a strong focus on usability and user experience. Page 2
Profile (7).pdf|6|Go-To-Market Strategy: Developed GTM plans focused on customer acquisition, retention, and revenue growth. Agile & Scrum Practices: Managed sprints, backlogs, and PRDs using tools like Jira to align c
Profile (7).pdf|7|January 2025 - April 2025 (4 months) Led a dynamic team of designers and sponsorship coordinators for RGIPT’s flagship cultural fest. Oversaw brand collaborations, strategic partnerships, and visual d
Profile (7).pdf|8|Real-world applications that you can start using today Product Design with 3D models in website makes more cool Understanding User experience for better reach and scale the product. Instawings Page 3 
Profile (7).pdf|9|implement and test solutions. Leveraged data-driven insights to improve product performance and user experience. AIChE RGIPT Student Chapter Designing - UI/UX (Product design) November 2023 - November
Profile (7).pdf|10|organization's branding guidelines. Through my work, I have developed strong skills in graphic design, layout design, and visual storytelling. I have also gained experience in project management, team
Profile (7).pdf|11|executive has been an enriching experience, allowing me to hone my creative skills while contributing to the growth of a dynamic student organization. E-CELL, RGIPT Startup Assistance Program Executiv
Profile (7).pdf|12|beyond. Additionally, I have collaborated with industry experts and investors to create networking opportunities for startups and help them secure funding. My efforts have resulted in the successful l
Profile (7).pdf|13|Education Rajiv Gandhi Institute of Petroleum Technology (RGIPT) Bachelor of Technology - BTech, Chemical Engineering · (August 2023 - August 2027) Master's PU High School Diploma, PCM Computer scienc