semester-fee-structures--0d245e6def.txt|0|A - A A + T हिंदी Toggle navigation Institute About Governance General Council Board of Governors Finance Committee Senate Director Registrar Vision and Mission Acts and Statutes RGIPT Act, 2007 RGIPT
semester-fee-structures--0d245e6def.txt|1|Electrical and Electronics Engineering Management Studies Mathematical Sciences Mechanical Engineering Petroleum Engineering and Geoengineering Energy and Human Sciences Research Central Instrumentati
semester-fee-structures--0d245e6def.txt|2|Alumni Affairs Faculty Affairs Non Teaching Staff Research and Development Resources and Planning Students' Affairs Faculty Faculty Honorary Adjunct Administrative Personnel Technical Personnel Counci
semester-fee-structures--0d245e6def.txt|3|Students' Achievements Student Activity Center (SAC) Students' Downloads Teaching Assistant Allocation Time Table Campus Life Campus View Amenities FAQs Flora and Fauna Guest Hostel Hostels Training M
semester-fee-structures--0d245e6def.txt|4|S.No. Subject View/Download M Tech Fee Structure-Students Admitted in the Academic Year 2024-25 View M Tech Fee Structure-Students Admitted in the Academic Year 2025-26 View PhD Fee Structure-Students
semester-fee-structures--0d245e6def.txt|5|View Semester Fee of PhD students admitted under Part-time External Category View Fee Structure for B Tech and IDD Students Admitted in Academic Year 2024-25 View Fee Structure for B Tech and IDD Stud
semester-fee-structures--0d245e6def.txt|6|View Fee Structure for M Tech Students Admitted in Academic Session 2024-25 View Fee Structure for M Tech Students Admitted in Academic Year 2023-24 w.e.f. Odd Semester 2024-25 View Fee Structure for 
semester-fee-structures--0d245e6def.txt|7|View For 2-year M Tech Programme 2023-24 View For Ph D Programme 2023-24 View For 3-year Diploma Programme 2023-24 View For 4-year B Tech and 5-year Integrated Dual Degree (Student Admitted in 2020-21
semester-fee-structures--0d245e6def.txt|8|Javascipt has been disabled. Javascipt has been disabled. Javascipt has been disabled. Javascipt has been disabled. Javascipt has been disabled. Javascipt has been disabled. Javascipt has been disable